[
  {
    "title": "G20 finance ministers agree to work toward effectively taxing the super-rich",
    "description": "RIO DE JANEIRO (AP) — Finance ministers from leading rich and developing nations agreed Friday to strive toward effectively taxing the super-rich, a joint ministerial declaration said.",
    "partial_text": "RIO DE JANEIRO (AP) — Finance ministers from leading rich and developing nations agreed Friday to strive toward effectively taxing the super-rich, a joint ministerial declaration said.\n“With full respect to tax sovereignty, we will seek to engage coo... [3599 chars]",
    "url": "https://ca.finance.yahoo.com/news/g20-finance-ministers-agree-toward-215643807.html",
    "published_at": "2024-07-26T22:37:18+00:00",
    "media_source_name": "Yahoo Canada Finance",
    "media_source_url": "ca.finance.yahoo.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "RIO DE JANEIRO (AP) — Finance ministers from leading rich and developing nations agreed Friday to strive toward effectively taxing the super-rich, a joint ministerial declaration said.\n\n“With full respect to tax sovereignty, we will seek to engage cooperatively to ensure that ultra-high-net-worth individuals are effectively taxed,” the declaration said after the two-day meeting in Rio de Janeiro.\n\nBrazil has made a proposal to impose a 2% minimum tax on billionaires a top priority of its presidency of the Group of 20, ahead of the Nov. 18-19 summit in Rio.\n\nWhile the final declaration stops short of agreeing on a specific global tax, Brazilian Finance Minister Fernando Haddad nevertheless called it a “significant step forward.”\n\nADVERTISEMENT\n\n“We were always optimistic about this result, but it really exceeded our initial expectations,” Haddad told reporters.\n\nBrazil's proposal to tax billionaires has divided G20 nations. France, Spain and South Africa have expressed support, while the U.S. is against.\n\n“Tax policy is very difficult to coordinate globally, and we don’t see a need or really think it’s desirable to try to negotiate a global agreement on that,” U.S. Treasury Secretary Janet Yellen told journalists Thursday.\n\nGovernments fear the super-rich would transfer their money to tax havens if a country individually adopted such a tax, said economist Rogério Studart, a senior fellow at the Brazilian Center for International Relations think tank.\n\n“When action is done collectively, everyone wins. When there is fragmentation, many lose,” Studart said.\n\nThe richest 1% have amassed $42 trillion in new wealth over the past decade, nearly 36 times more than the entire bottom 50% of the world’s population, according to an Oxfam analysis released Thursday ahead of the finance ministers’ meeting.\n\nBillionaires currently pay the equivalent of 0.3% of their wealth in taxes, according to a report by Gabriel Zucman, commissioned by Brazil. A 2% tax would raise $200 billion to $250 billion per year globally from about 3,000 individuals, money that could fund public services such as education and health care as well as the fight against climate change, the report said.\n\nStory continues\n\nZucman, who is the founding director of the Paris-based EU Tax Observatory, celebrated the outcome of the finance ministers' meeting.\n\n“For the first time in history, there is now a consensus among G20 countries that the way we tax the super-rich must be fixed, and a commitment to work together for this. It’s an important step in the right direction,” he said in a statement.\n\nNGOs also welcomed the declaration, while encouraging further action at the G20 summit in November.\n\nExtreme weather events made more likely by climate change are expected to cost “trillions of dollars every year and it is outrageous to expect that the regular taxpayer should pay for it,” Camila Jardim, a international politics specialist with Greenpeace Brazil, said in a statement.\n\nBrazil has put inequality, poverty and hunger at the heart of its presidency of the G20. President Luiz Inácio Lula da Silva defended the need for increased taxation of the world’s richest in Rio on Wednesday when he unveiled plans for a global alliance against hunger and poverty.\n\nBrazil is also pushing for changes in global governance institutions and advocating for a sustainable energy transition.\n\nOn the sidelines of the discussions around taxation, Haddad and Yellen on Friday announced the launch of a climate partnership between Brazil’s Ministry of Finance and the U.S. Treasury.\n\nIt will seek “to address today’s most pressing environmental challenges and strengthen the region’s green economy,” Yellen said, citing efforts to bolster clean energy supply chains and improve the integrity and effectiveness of the voluntary carbon market.\n\nEléonore Hughes, The Associated Press",
    "tags": [
      "Technology",
      "News",
      "Cannabis"
    ],
    "nltk_summary": "RIO DE JANEIRO (AP) — Finance ministers from leading rich and developing nations agreed Friday to strive toward effectively taxing the super-rich, a joint ministerial declaration said.\nThe richest 1% have amassed $42 trillion in new wealth over the past decade, nearly 36 times more than the entire bottom 50% of the world’s population, according to an Oxfam analysis released Thursday ahead of the finance ministers’ meeting.\nStory continuesZucman, who is the founding director of the Paris-based EU Tax Observatory, celebrated the outcome of the finance ministers' meeting.\n“For the first time in history, there is now a consensus among G20 countries that the way we tax the super-rich must be fixed, and a commitment to work together for this.\nNGOs also welcomed the declaration, while encouraging further action at the G20 summit in November.",
    "nltk_keywords": [
      "finance",
      "haddad",
      "declaration",
      "work",
      "yellen",
      "g20",
      "tax",
      "superrich",
      "ministers",
      "rio",
      "agree",
      "effectively",
      "global",
      "taxing"
    ]
  },
  {
    "title": "U.S. Treasury, Brazil's Finance Ministry announce climate partnership",
    "description": "The Treasury Department and Brazil's Ministry of Finance announced Friday a partnership to align best environmental and climate policies.",
    "partial_text": "Treasury Secretary Janet Yellen speaks during a Senate Appropriations Subcommittee on Financial Services and General Government hearing on June 4. She announced a climate change partnership with Brazil on Friday. Photo by Ken Cedeno/UPI | License Pho... [1812 chars]",
    "url": "https://www.upi.com/Top_News/World-News/2024/07/26/Treasury-Fazenda-climate-change-partnership/3951722014730/",
    "published_at": "2024-07-26T17:56:29+00:00",
    "media_source_name": "UPI News",
    "media_source_url": "www.upi.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Treasury Secretary Janet Yellen speaks during a Senate Appropriations Subcommittee on Financial Services and General Government hearing on June 4. She announced a climate change partnership with Brazil on Friday. Photo by Ken Cedeno/UPI | License Photo\n\nJuly 26 (UPI) -- The Treasury Department and Brazil's Ministry of Finance announced Friday a partnership to align best environmental and climate policies. Officials from the Treasury and Brazil's ministry, known as the Fazenda, started working together in 2023 to address climate change and economic development. Advertisement\n\nThe Brazil Fazenda-U.S. Treasury Climate Partnership will help foster public and private efforts between the two countries about climate change jobs and policies dealing with the environment.\n\n\"Brazil and the United States have a deep economic relationship through trade and investment and share a commitment to sustainable, inclusive development,\" the Treasury said in a statement. \"We both recognize that climate and development go hand in hand and, when well-designed are mutually reinforcing and serve as catalysts for economic growth.\"\n\nTreasury Secretary Janet Yellen said the United States and Brazil have deep ties from trade to investments and that the two of the largest economies in the Western Hemisphere can move climate change initiatives forward.\n\n\"Today's announcement also builds on significant efforts of teams at Treasury and Fazenda in recent years,\" Yellen said in a statement. \"Since the start of the Biden administration, we have worked to increase collaboration with Brazil on shared priorities related to climate and the environment.\"\n\nAdvertisement\n\nYellen said the recent flooding in Rio Grande do Sul in southern Brazil in April was just the most recent example of the effects of climate change and the need of resilient infrastructure to save lives.\n\n\"It was one of far too many recent tragedies that reveal the grave threat that climate change and the loss of natural and biodiversity means to lives, livelihoods and economies around the world,\" Yellen said.",
    "tags": [
      "Janet Yellen",
      "Weather & Climate"
    ],
    "nltk_summary": "Treasury Secretary Janet Yellen speaks during a Senate Appropriations Subcommittee on Financial Services and General Government hearing on June 4.\nShe announced a climate change partnership with Brazil on Friday.\nPhoto by Ken Cedeno/UPI | License PhotoJuly 26 (UPI) -- The Treasury Department and Brazil's Ministry of Finance announced Friday a partnership to align best environmental and climate policies.\nOfficials from the Treasury and Brazil's ministry, known as the Fazenda, started working together in 2023 to address climate change and economic development.\nAdvertisementThe Brazil Fazenda-U.S. Treasury Climate Partnership will help foster public and private efforts between the two countries about climate change jobs and policies dealing with the environment.",
    "nltk_keywords": [
      "treasury",
      "finance",
      "development",
      "brazils",
      "announce",
      "yellen",
      "partnership",
      "brazil",
      "recent",
      "ministry",
      "united",
      "economic",
      "climate",
      "change"
    ]
  },
  {
    "title": "'No State Denied Anything': Finance Minister Sitharaman Responds To Opposition's Criticism Of Budget 2024",
    "description": "Opposition leaders had criticised that the Finance Minister's speech earlier this week mentioned only two states - Andhra Pradesh and Bihar, both ruled by key BJP allies",
    "partial_text": "Union Finance Minister Nirmala Sitharaman on Friday responded to the Opposition’s criticism of budget 2024 and stressed that no state has been denied anything. Opposition leaders had criticised that the Finance Minister’s speech earlier this week men... [1559 chars]",
    "url": "https://www.news18.com/politics/no-state-denied-anything-finance-minister-sitharaman-responds-to-oppositions-criticism-of-budget-2024-8980191.html",
    "published_at": "2024-07-26T16:08:22+00:00",
    "media_source_name": "News18",
    "media_source_url": "www.news18.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Union Finance Minister Nirmala Sitharaman on Friday responded to the Opposition’s criticism of budget 2024 and stressed that no state has been denied anything. Opposition leaders had criticised that the Finance Minister’s speech earlier this week mentioned only two states – Andhra Pradesh and Bihar, both ruled by key BJP allies.\n\nIn an interview with NDTV, Sitharaman said, “States are receiving allocations as they have in the past… no state has been denied anything. The Act (Andhra Pradesh Reorganisation Act) requires the centre to support (the state) in building its capital city and developing backward regions.”\n\nFinance Minister Nirmala Sitharaman On Fuel Prices\n\nSpeaking about the hike in fuel prices, the Finance Minister stated that Petrol and diesel could be taxed under GST (Goods and Services Tax) rather than VAT (Value Added Tax) if state governments agree to the proposal and fix a suitable rate.\n\n“If they fix the rate and all come together… and decide that GST will include petroleum products, then we can implement it immediately,” Sitharaman said.\n\nAt present, petrol and diesel prices vary from state to state because each has a different tax.\n\nFinance Minister Nirmala Sitharaman On Debt\n\nSitharaman said fixing a number for the eventual fiscal deficit and working towards it with temporary solutions every year can be a step towards reducing debt, but it is not the “right way from a macroeconomic perspective”.\n\n“We have chosen a healthy option for getting the fiscal deficit closer to the number. Instead of looking at the number alone, it is also about the way you decide to get there. An obvious method for every country is to reduce debt, but borrowing is a must for a growing economy. The question is how much are you borrowing and where it is being used,” the Finance Minister noted.",
    "tags": [],
    "nltk_summary": "Union Finance Minister Nirmala Sitharaman on Friday responded to the Opposition’s criticism of budget 2024 and stressed that no state has been denied anything.\nOpposition leaders had criticised that the Finance Minister’s speech earlier this week mentioned only two states – Andhra Pradesh and Bihar, both ruled by key BJP allies.\nIn an interview with NDTV, Sitharaman said, “States are receiving allocations as they have in the past… no state has been denied anything.\nAt present, petrol and diesel prices vary from state to state because each has a different tax.\nThe question is how much are you borrowing and where it is being used,” the Finance Minister noted.",
    "nltk_keywords": [
      "finance",
      "budget",
      "oppositions",
      "2024",
      "way",
      "states",
      "denied",
      "responds",
      "nirmala",
      "criticism",
      "tax",
      "sitharaman",
      "prices",
      "minister",
      "number",
      "state"
    ]
  },
  {
    "title": "UK finance chief Reeves pledges most 'pro-business' government",
    "description": "U.K. Finance Minister Rachel Reeves said Friday that the new Labour government would be the most pro-growth and pro-business the country has seen.",
    "partial_text": "Reeves, who has been in post for three weeks following Labour's landslide victory in the U.K.'s July 4 general election, was speaking from Rio de Janeiro where she is attending a meeting of G20 finance ministers.\n\"I will work with business to make su... [3513 chars]",
    "url": "https://www.cnbc.com/2024/07/26/uk-finance-chief-reeves-pledges-most-pro-business-government.html",
    "published_at": "2024-07-26T16:06:32+00:00",
    "media_source_name": "CNBC",
    "media_source_url": "www.cnbc.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Reeves, who has been in post for three weeks following Labour's landslide victory in the U.K.'s July 4 general election, was speaking from Rio de Janeiro where she is attending a meeting of G20 finance ministers.\n\n\"I will work with business to make sure we're doing all we can to bring wealth creation, to bring business investment to the U.K. economy,\" she added.\n\n\"This is going to be the most pro-growth, pro-business Treasury that this country has ever seen,\" Reeves, who is chancellor of the exchequer, told CNBC's Steve Sedgwick via remote interview.\n\nReeves told CNBC that it was only through wealth creation that the living standards of ordinary Britons would be improved and more money would be available to invest in public services.\n\nLONDON — U.K. Finance Minister Rachel Reeves said Friday that the new Labour government would be the most pro-growth and pro-business the country has seen.\n\nThe chancellor said she has already met with business leaders who are interested in doing business in the U.K. She acknowledged, however, that businesses needed more clarity on taxation.\n\nOn Monday, Reeves will outline the results of an audit of the Treasury, in which she is expected to reveal a £20 billion ($25.7 billion) black hole in the public finances.\n\nThe announcement could pave the way for a tax-rising autumn budget, the first major fiscal event of the new government. The date of the financial plan will also be announced Monday.\n\nReeves declined to comment on the precise details, saying \"issues around taxes are rightly for the budget.\" But she added that she wants to ensure Britain has a \"competitive tax system.\"\n\n\"I want taxes to be as low as possible, but unlike the previous government I'm not going to make promises that I'm not able to keep, and without being able to say where the money's going to come from. The No. 1 mission of this new government is to grow the economy, and to grow the economy we need to attract wealth creators to Britain,\" she said.\n\n\"We can't tax and spend our way to higher growth and to greater prosperity. We need to attract business investment to be able to do that.\"\n\nReeves has previously ruled out increases to income tax, national insurance, VAT or corporation tax — the main sources of government revenues. However, the chancellor has a fine balance to tread given pledges from her party to also boost national investment and public sector pay.\n\nPrime Minister Keir Starmer indicated on Wednesday that there would be tough fiscal decisions ahead, telling Parliament that his government faces \"a more severe crisis than we thought\" as its goes through the books of the last 14 years of Conservative rule.\n\nThe center-left leader has vowed to take a hard line on public spending until the country's finances are back in order. On Tuesday he suspended seven party members who voted against him on a proposal to scrap the two-child benefits spending cap.\n\nLabour's pledge to return the country to economic growth was again reiterated as a \"fundamental mission\" in the King's Speech last week, as the country seeks to emerge from its cost-of-living crisis.\n\nAmong the economic measures previously announced by the government are the nationalization of rail operators and the creation of a publicly owned clean power company, as well as further investment in public services and the creation of new homes.\n\nThe G20 meeting marks an early outing for the new finance minister, who heralded the opportunity \"to reset\" some of Britain's relationships with its international counterparts.\n\nThe comments echo similar remarks made by Starmer at the European Political Community summit last week, as he seeks to distance his government from the former U.K. leadership.\n\nWatch CNBC's full interview with Rachel Reeves on Monday, July 29.",
    "tags": [],
    "nltk_summary": "\"I will work with business to make sure we're doing all we can to bring wealth creation, to bring business investment to the U.K. economy,\" she added.\n\"This is going to be the most pro-growth, pro-business Treasury that this country has ever seen,\" Reeves, who is chancellor of the exchequer, told CNBC's Steve Sedgwick via remote interview.\nLONDON — U.K. Finance Minister Rachel Reeves said Friday that the new Labour government would be the most pro-growth and pro-business the country has seen.\nWe need to attract business investment to be able to do that.\"\nHowever, the chancellor has a fine balance to tread given pledges from her party to also boost national investment and public sector pay.",
    "nltk_keywords": [
      "progrowth",
      "pledges",
      "finance",
      "wealth",
      "probusiness",
      "public",
      "country",
      "reeves",
      "tax",
      "creation",
      "minister",
      "rachel",
      "investment",
      "uk",
      "business",
      "seen"
    ]
  },
  {
    "title": "New UK finance minister to outline fiscal 'mess', raising chance of tax rises",
    "description": "By Alistair Smout, David Milliken and David Lawder",
    "partial_text": "New UK finance minister to outline fiscal ‘mess’, raising chance of tax rises\nreuters_tickers\n5 minutes\nBy Alistair Smout, David Milliken and David Lawder\nLONDON/RIO DE JANEIRO (Reuters) – New British finance minister Rachel Reeves will spell out on ... [5276 chars]",
    "url": "https://www.swissinfo.ch/eng/new-uk-finance-minister-to-outline-fiscal-%27mess%27%2c-raising-chance-of-tax-rises/85061252",
    "published_at": "2024-07-26T13:46:11+00:00",
    "media_source_name": "Swissinfo (EN)",
    "media_source_url": "www.swissinfo.ch/eng",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "New UK finance minister to outline fiscal ‘mess’, raising chance of tax rises\n\nreuters_tickers\n\n5 minutes\n\nBy Alistair Smout, David Milliken and David Lawder\n\nLONDON/RIO DE JANEIRO (Reuters) – New British finance minister Rachel Reeves will spell out on Monday the scale of the public finances mess she says she has inherited, potentially paving the way for tax rises that critics say she could have been more candid about before the election.\n\nFollowing Labour’s July 4 election victory, Reeves ordered an assessment of public spending needs which were not fully captured by official budget forecasts published in March.\n\nReeves repeatedly said the election winner would inherit the worst set of economic circumstances since World War Two, but ruled out raising the rates of almost all main taxes to fix this.\n\nLabour sources said on Friday that Reeves now expected to reveal a 20-billion-pound ($26 billion) hole in the public finances.\n\nThe Office for Budget Responsibility – Britain’s independent fiscal watchdog – said in March that the previous Conservative government’s five-year budget plans left just 8.9 billion pounds of leeway to meet a self-imposed rule designed to stop debt rising.\n\nReeves has said that – while she would rather lower taxes than raise them – she would not make any pledges that she could not stick to under debt rules which Labour pledged to follow.\n\nAnticipating criticism of her assessment of the finances, Reeves told reporters at a G20 finance leaders’ meeting in Brazil late on Thursday that she had been frank about the need to repair public services and stop debt rising.\n\n“We have inherited a mess,” she said. “I’ve always been honest that the scale of the challenge confronting this new government is immense because of the damage done to the economy and to public services by the Conservatives.”\n\nReeves declined to comment on whether the hole was 20 billion pounds or how exactly she intended to cover it before addressing parliament.\n\nThe Conservatives immediately attacked the 20-billion-pound figure as a prelude to unnecessary tax rises.\n\n“Labour’s claims are nothing but a fabrication – the books have been wide open since the OBR was set up 14 years ago,” Conservative former finance minister Jeremy Hunt said.\n\nPOLITICAL EXERCISE\n\nNew Prime Minister Keir Starmer said on Wednesday “we have a more severe crisis than we thought as we go through the books” after 14 years of Conservative government, which ministers have said impacts everything from prisons to immigration and health.\n\nBut economists and analysts said that although a finance ministry review of spending needs might soften the political blow from tax rises, in economic terms there were no big surprises that Labour could not have foreseen.\n\nReeves herself told the Financial Times in June that Labour did not need to win an election to find out about the bad state of public finances.\n\nThe Labour Party’s manifesto heading into the election spelled out small tax rises to fund specific commitments but other fiscal details were scant, aside from a general commitment to boost resources through higher growth.\n\nNeither main party set out how it would meet funding shortfalls forecast to hit the health service, and Labour accepted Conservative fiscal plans to cut spending on some public services which analysts had not considered tenable.\n\nBen Zaranko, senior research economist at the non-partisan Institute for Fiscal Studies think tank, said Reeves’ statement would be “a political exercise, not a genuine response to new information”.\n\n“I think that the fiscal challenge awaiting this government was apparent to anyone who cared to look…. Maybe some of the specifics are a surprise, but the overall trend was clear,” he said. “Neither party was being fully open about the challenge.”\n\nRED LINES\n\nThe fiscal picture is slightly worse in some areas than Labour might have expected.\n\nBorrowing in the three months to the end of June was 3.2 billion pounds higher than the OBR forecast in March.\n\nDebt is the highest since the early 1960s at 99.5% of GDP, 0.8 percentage points more than forecast, while the tax burden is already the highest since the late 1940s.\n\nReeves has also hinted she will accept a public-sector pay award recommendation that teachers and health workers receive a rise of a reported 5.5%, higher than expected.\n\nShe is set to outline that pay award on Monday too, along with the date of the next budget.\n\nPantheon Macroeconomics said such a pay award would use up almost all the fiscal headroom left over after Hunt’s March budget.\n\n“What’s more, we estimate that the fiscal situation has worsened since (March),” it said.\n\nThe Labour Party has ruled out increases to the rates of income tax, National Insurance social security payments, value-added tax and corporation tax, tying its hands on the sources of future tax revenue.\n\nFormer Bank of England policymaker Michael Saunders, now a senior economic advisor at Oxford Economics, said the government could increase taxes by between 10-25 billion pounds, and would likely focus on inheritance tax or capital gains tax to avoid breaking election commitments.\n\nBut while Labour’s promise not to raise specific personal tax rates might be possible this year, the IFS’s Zaranko warned that it would come under increasing pressure if the government was unable to generate the growth it wants.\n\n“Maybe eventually they’ll be forced to revisit those red lines,” he said. “The longer the parliament goes on, I think that it’ll be more and more difficult.”\n\n($1 = 0.7772 pounds)",
    "tags": [],
    "nltk_summary": "Labour sources said on Friday that Reeves now expected to reveal a 20-billion-pound ($26 billion) hole in the public finances.\nBorrowing in the three months to the end of June was 3.2 billion pounds higher than the OBR forecast in March.\nShe is set to outline that pay award on Monday too, along with the date of the next budget.\nPantheon Macroeconomics said such a pay award would use up almost all the fiscal headroom left over after Hunt’s March budget.\nThe Labour Party has ruled out increases to the rates of income tax, National Insurance social security payments, value-added tax and corporation tax, tying its hands on the sources of future tax revenue.",
    "nltk_keywords": [
      "finance",
      "labour",
      "fiscal",
      "raising",
      "public",
      "pounds",
      "set",
      "mess",
      "reeves",
      "tax",
      "outline",
      "minister",
      "chance",
      "billion",
      "uk",
      "rises",
      "election"
    ]
  },
  {
    "title": "Finance Manager",
    "description": "COME GROW WITH US! McDougall Energy is a Canadian family-owned business that distributes quality petroleum products and services reliably and responsibly.",
    "partial_text": "COME GROW WITH US!\nMcDougall Energy is a Canadian family-owned business that distributes quality petroleum products and services reliably and responsibly. We are dedicated to delivering customized solutions that meet customers’ needs, improve lives, ... [3505 chars]",
    "url": "https://www.sootoday.com/classifieds/careers/business-finance/1888035",
    "published_at": "2024-07-26T13:42:07+00:00",
    "media_source_name": "SooToday",
    "media_source_url": "www.sootoday.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "COME GROW WITH US!\n\nMcDougall Energy is a Canadian family-owned business that distributes quality petroleum products and services reliably and responsibly. We are dedicated to delivering customized solutions that meet customers’ needs, improve lives, and enrich communities.\n\n\n\nAt McDougall Energy, we believe every team member has a role in fulfilling our purpose. That's why we give our people the trust, support, and opportunities they need to do their best work. We invite you to join us as we continue to connect customers with the energy solutions of today and tomorrow.\n\n\n\nWe are proud to be recognized as a Platinum Club member of Canada's Best Managed Companies, having consecutively retained our designation since 2011.\n\nABOUT THE OPPORTUNITY:\n\nMcDougall Energy is looking for a strategic thinking self-starter with strong attention to detail as a Finance Manager. Reporting to the Director, Finance, the Finance Manager is a highly visible member of the Finance team responsible for leading the financial reporting and analysis functions of the company.\n\nResponsibilities include:\n\nSupervise the month-end close process, ensuring accuracy and timeliness of financial reporting.\n\nAssist with the preparation of year-end external audit working papers, lead sheets and reconciliations.\n\nCollaborate with cross-functional teams to provide financial insights and champion operating expense profit planning and reporting for business lines operational managers.\n\nAssist with training to ensure finance resources are knowledgeable on accounting policies and procedures.\n\nPrepare provincial and federal regulatory reports within appropriate deadlines.\n\nDevelop and implement internal controls and procedures to enhance financial reporting accuracy and efficiency.\n\nLead and mentor finance team members, fostering a culture of continuous improvement and professional development.\n\nPrepare ad-hoc financial reports and analysis as required by management.\n\nABOUT YOU:\n\nBachelor’s degree in business or finance from an accredited University\n\nChartered Professional Accounting Designation (CPA) in good standing\n\nMinimum 2 years of experience in a management role; industry experience an asset\n\nSuperior management experience in the accounting function in a computerized and accounting software environment; ERP experience is preferred\n\nDemonstrated ability to manage large volumes of data; Strong attention to detail\n\nExcellent interpersonal and communication skills; both verbal and written\n\nSuperior organization and prioritization skills; committed to deadlines\n\nDemonstrated ability to shift focus with ease\n\nProficient in working with Microsoft Office; specifically, Excel\n\nStrong understanding of Privacy and Confidentiality in the workplace\n\nDemonstrated ability to establish and maintain successful working relationships\n\nDemonstrated success in living the values of The M.E.I. Way\n\nWHAT WE OFFER:\n\nWe provide career growth and development through on-the-job training, professional courses, and peer learning in a friendly and inclusive work environment that allows you to thrive both personally and professionally.\n\nCompetitive Compensation\n\n4 weeks paid vacation\n\nEmployer Health & Dental Benefits\n\nGroup RRSP\n\nEmployee Assistance Program (EAP)\n\nHealthcare & Lifestyle Spending Account\n\nAre you ready to power your career and make a difference at McDougall Energy? Get energized and apply online at www.mcdougallenergy.com/careers\n\nMcDougall Energy is committed to an inclusive, barrier-free recruitment and selection process and workplace. If you require any accommodation, please notify us and we will work with you to meet your needs. Confidentiality of all applicants assured. Only those selected for interviews will be contacted and we thank all other applicants for their interest.",
    "tags": [],
    "nltk_summary": "ABOUT THE OPPORTUNITY:McDougall Energy is looking for a strategic thinking self-starter with strong attention to detail as a Finance Manager.\nReporting to the Director, Finance, the Finance Manager is a highly visible member of the Finance team responsible for leading the financial reporting and analysis functions of the company.\nResponsibilities include:Supervise the month-end close process, ensuring accuracy and timeliness of financial reporting.\nDevelop and implement internal controls and procedures to enhance financial reporting accuracy and efficiency.\nLead and mentor finance team members, fostering a culture of continuous improvement and professional development.",
    "nltk_keywords": [
      "experience",
      "finance",
      "accounting",
      "financial",
      "working",
      "work",
      "manager",
      "reporting",
      "professional",
      "energy",
      "team"
    ]
  },
  {
    "title": "Health care CFOs look beyond cutting costs to juice profitability",
    "description": "Research by Deloitte examines the top priorities for finance chiefs.",
    "partial_text": "Good morning. Health care CFOs are concerned about profitability, while not compromising on delivering high-quality and affordable care. Traditionally, they’ve relied mostly on cutting costs, but that may be changing.\nDeloitte Center for Health Solut... [9127 chars]",
    "url": "https://fortune.com/2024/07/26/health-care-cfo-look-beyond-cutting-costs-for-profitability/",
    "published_at": "2024-07-26T04:00:00+00:00",
    "media_source_name": "Fortune",
    "media_source_url": "fortune.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Good morning. Health care CFOs are concerned about profitability, while not compromising on delivering high-quality and affordable care. Traditionally, they’ve relied mostly on cutting costs, but that may be changing.\n\nDeloitte Center for Health Solutions has surveyed CFOs annually since 2020. In prior years, cost reduction was consistently named one of the top three organizational priorities. However, cost reduction ranked last among the top priorities and concerns of finance leaders in 2024, according to the latest survey. (The top three are the economy, cybersecurity, and the impact of the upcoming U.S. presidential election.)\n\nCourtesy of Deloitte\n\nThe majority of finance chiefs surveyed are focusing on improving their organization’s operating margin, Deloitte found. “I was pleasantly surprised to see CFOs setting ambitious financial improvement targets for the near term,” Tina Wheeler, vice chair, health care sector leader at Deloitte LLP, told me. A third of CFOs surveyed are aiming to improve their operating margin by three or more percentage points over the next three years, she said.\n\nThe health care industry has been experiencing a period of low profitability, with operating margins of 1% to 4%, on average, in the past five years, according to Deloitte. So CFOs meeting aggressive margin targets is, “a much-needed goal,” Wheeler said.\n\nThe firm recommends “operating margin transformation levers” that CFOs should consider using across four major categories—strategic growth, revenue growth, cost reduction, and capital deployment.\n\nWheeler also said there are four overlooked opportunities for margin improvement:\n\n—Adding new products and services and discontinuing offerings that do not add financial value.\n\n—Forming alliances. “Organizations risk slower growth and poorer performance if they operate alone,” she said. Value-based partnerships, along with market-based alliances provide opportunities to codevelop products and services, expand customer reach, and increase revenue.\n\n—Outsourcing and offshoring opportunities. For example, outsourcing administrative functions.\n\n—”Doubling down” on digital and AI technologies.\n\n“While cost reduction is no longer the dominant focus for margin improvement initiatives, it is still an important part of the portfolio for both health system and health plan finance leaders,” Wheeler said.\n\nThe main lever for cost reduction is building an efficient workforce, she said. “This will continue to be important as many health care organizations are grappling with employee turnover and burnout coupled with increasing labor costs,” she said. Emerging technologies, like generative AI, can be useful for workforce management strategies, “potentially leading to substantial cost savings,” she added.\n\nHave a good weekend.\n\nSheryl Estrada\n\nsheryl.estrada@fortune.com\n\nThe following sections of CFO Daily were curated by Greg McKenna\n\nLeaderboard\n\nSome notable moves this week:\n\nRichard Kraemer was named senior EVP and CFO at Fulton Financial Corporation (NASDAQ: FULT), effective Sept. 3. Kraemer replaces interim CFO Betsy Chivinski, who will retire from Fulton at the end of the year. Kraemer has more than 20 years in the financial services industry, most recently serving as chief banking officer overseeing commercial markets for another bank.\n\nPaul Lundstrom, CFO at Flex (NASDAQ: FLEX), will step down as CFO, effective July 31, to pursue an opportunity outside of the company. Jaime Martinez will assume the role of interim CFO. Martinez has over 20 years of experience with Flex and has held various finance leadership roles. Flex has initiated an executive search process to identify a permanent CFO.\n\nAkhil Shrivastava was promoted to EVP and CFO at The Estée Lauder Companies Inc. (NYSE: EL), effective Nov. 1. Shrivastava succeeds Tracey T. Travis, whose intention to retire was announced on July 11. Travis will remain at the company for a transition period until June 30, 2025. Since joining ELC in 2015, Akhil has held several senior finance roles within the company. He was recently named ELC’s SVP and corporate controller. Before that, he was SVP and treasurer. Akhil will also serve as a member of several of ELC’s senior management leadership groups.\n\nHelen Shan was promoted to CFO at FactSet (NYSE: FDS) (NASDAQ: FDS), a global financial digital platform, effective immediately. Shan succeeds Linda Huber, who is leaving the company. Huber’s departure is not the result of any disagreement with the company and not the result of any financial or accounting matters, according to FactSet. Shan is rotating back into the CFO role, which she previously held from 2018 to 2021 before being appointed EVP and chief revenue officer.\n\nJonathan Geehan was promoted to CFO at Techstars, a pre-seed investor. Geehan has been at Techstars for three years, having served in the finance department as SVP and senior controller. Geehan brings more than two decades of experience in finance, including over 16 years within venture capital and private equity. He joined Techstars from ClearSky where he was the investment firm’s CFO. Previously, he was controller at Fairhaven Capital Partners.\n\nMike Kaswan was named CFO at Precision Neuroscience Corporation. Kaswan brings over 30 years of financial leadership experience in health care to his role. Most recently, he served as the CFO at Orchestra BioMed Holdings (NASDAQ: OBIO), which he helped take public in 2023. He also cofounded Georgia Veterinary Specialists (now part of BluePearl Veterinary Partners); Lumenos (now part of Wellpoint); and Persante Health Care, a provider of sleep and balance diagnostics and treatments.\n\nAlonso Sotomayor was named CFO at DynaResource, Inc. (OTCQX:DYNR), a junior gold mining producer, effective immediately. Sotomayor has over 15 years of professional experience. He started his career in a mining-specific role with accounting firm McGovern Hurley LLP, followed by progressively senior roles in the Toronto Mining Groups at KPMG and Deloitte Canada. Since 2017, Mr. Sotomayor has held the position of Corporate Controller of Ascendant Resources Inc. and Corporate Controller of Cerrado Gold Inc. since 2020.\n\nAaron Rosenberg was named CFO at BeiGene, Ltd. (Nasdaq: BGNE), a global oncology company, effective July 22. Rosenberg will succeed Julia Wang, who is departing to pursue external opportunities and will stay with the company through August. Rosenberg has more than 20 years of experience at Merck & Co., Inc., most recently serving as SVP and corporate treasurer. He also held roles such as SVP of corporate strategy and planning and VP and finance lead of Merck Animal Health.\n\nLogan Powell, global president and CFO at Puttshack, a provider of tech-infused mini-golf venues, was promoted to CEO, effective immediately. Powell succeeds Joe Vrankin, who oversaw the company’s growth in the U.K. as CEO and subsequently brought the concept to the U.S. in 2021. Powell and Vrankin have collaborated on this transition, as Vrankin will be moving on from the company. Powell has served as CFO since 2019. Before joining Puttshack, he was a partner at Copper Beech Capital, LLC.\n\nBig Deal\n\nBusiness leaders are already reporting a return on their organizations’ investments in AI, but many have neglected the underlying infrastructure AI needs to thrive, according to new research from EY. The firm’s first AI Pulse Survey polled 500 U.S. senior leaders across a wide range of industries from tech to government and the public sector.\n\nAbout three-quarters of those leaders said they are experiencing positive ROI on operational efficiencies (77%), employee productivity (74%) and customer satisfaction (72%). Leaders from organizations who have invested 5% or more of their total budgets in AI saw higher rates of return compared to those whose spending is under that threshold.\n\n“Business leaders are beginning to shape their future by raising strategic AI investments,” Traci Gusher, data and automation leader at EY Americas, said in a statement. “But the survey uncovered significant risks on the path to enterprise-wide AI adoption, including data infrastructure, ethical frameworks, and talent acquisition.”\n\nOnly 36% of those surveyed said they’re investing in data infrastructure fully and at scale. A similar number said the same for building an AI governance framework (34%), as well as training and upskilling employees (37%).\n\nGoing deeper\n\nHere are a few Fortune weekend reads:\n\n“Sequoia Capital invested early in Google, Nvidia, and Apple. Can Roelof Botha keep the legendary venture capital firm ahead in the AI future?” by Michal Lev-Ram\n\n“Tesla’s latest earnings expose chronically weak profitability and an inflated share price” by Shawn Tully\n\n“The Fortune 50 Best Places to Live will serve multigenerational families for the long haul” by Alexa Mikhail\n\n“Kamala Harris’s economic agenda: What experts say it might look like” by Alicia Adamczyk\n\nOverheard\n\n“I would characterize his economic approach as one that’s fully consistent with [1980s Democratic candidates] Walter Mondale and Michael Dukakis—a pro-worker party based around a lot of government intervention and managing the economy.”\n\n—Richard M. Reinsch II, an editor at the American Institute for Economic Research, told Fortune’s Jeff John Roberts regarding his opinion on Republican vice presidential nominee J.D. Vance’s potential economic approach.",
    "tags": [
      "Real Estate",
      "Broadsheet",
      "Term Sheet",
      "AI",
      "CFO Daily",
      "CHRO Daily",
      "The Trust Factor",
      "Data Sheet"
    ],
    "nltk_summary": "Health care CFOs are concerned about profitability, while not compromising on delivering high-quality and affordable care.\nHowever, cost reduction ranked last among the top priorities and concerns of finance leaders in 2024, according to the latest survey.\n“I was pleasantly surprised to see CFOs setting ambitious financial improvement targets for the near term,” Tina Wheeler, vice chair, health care sector leader at Deloitte LLP, told me.\nThe health care industry has been experiencing a period of low profitability, with operating margins of 1% to 4%, on average, in the past five years, according to Deloitte.\n“This will continue to be important as many health care organizations are grappling with employee turnover and burnout coupled with increasing labor costs,” she said.",
    "nltk_keywords": [
      "finance",
      "ai",
      "financial",
      "cfos",
      "care",
      "health",
      "effective",
      "look",
      "company",
      "leaders",
      "senior",
      "juice",
      "costs",
      "cfo",
      "cutting",
      "profitability"
    ]
  },
  {
    "title": "Understanding impact of Budget on personal finance",
    "description": "The 2024 Union Budget simplifies personal finance with updated tax slabs, revised capital gains rates, and higher pension contributions. Key changes include increased standard deductions and the removal of indexation benefits, streamlining the tax system for better financial planning.",
    "partial_text": "With the unveiling of Union Budget 2024-25, personal finance is set for a transformation that promises both simplification and strategic shifts. Although the anticipated increase in the tax-free threshold didn't materialize, the proposed changes sign... [3732 chars]",
    "url": "https://www.livemint.com/money/personal-finance/union-budget-personal-finance-income-tax-slabs-capital-gains-tax-standard-deductions-indexation-property-sale-gold-mfs-11721882912676.html",
    "published_at": "2024-07-25T18:30:00+00:00",
    "media_source_name": "Livemint",
    "media_source_url": "www.livemint.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "With the unveiling of Union Budget 2024-25, personal finance is set for a transformation that promises both simplification and strategic shifts. Although the anticipated increase in the tax-free threshold didn't materialize, the proposed changes signal a move towards a more streamlined tax system. Finance minister Nirmala Sitharaman is recalibrating the tax landscape, favouring reduced rates, broader slabs, and fewer deductions to make the new regime more appealing.\n\nHere’s a closer look at the key proposals shaping personal finance.\n\nFor salaried individuals earning above ₹15,75,000, the expanded tax slabs and increased standard deduction from ₹50,000 to ₹75,000 could potentially save ₹17,500, excluding surcharge and cess. The Budget also proposes raising the employer’s contribution to the New Pension Scheme (NPS) from 10% to 14% of salary for those opting for the new tax regime. This change offers employees a chance to negotiate a higher NPS contribution from their employers.\n\nHowever, it’s important to note that contributions exceeding ₹750,000 to the NPS, Employee Provident Fund (EPF), and superannuation fund will remain taxable under current laws.\n\nRead this | How the Budget affects your salaries, investments and taxes\n\nThe Budget has proposed substantial changes to capital gains taxation. Holding periods for determining short-term versus long-term assets are simplified: 12 months for listed securities, equity-oriented mutual funds, and REIT/InVIT units, and 24 months for assets like real estate, gold, and unlisted shares. The proposed long-term capital gains tax rate of 12.5% will apply uniformly across all asset classes, while short-term capital gains rates will increase from 15% to 20%.\n\nAdditionally, the removal of angel tax, effective 1 April 2024, is a welcome development for the startup community.\n\nDebt mutual funds purchased before 1 April 2023, will now be considered long-term if held for 24 months, and taxed at a flat 12.5% without indexation. For mutual funds acquired on or after 1 April 2023, gains will be classified as short-term and taxed at slab rates. Specified mutual funds now exclude gold ETFs and gold mutual funds, which will be taxed at 12.5% without indexation if held for over 12 months, starting FY26.\n\nThe Budget also proposes removing indexation benefits for assets like immovable property and gold, aligning with the new flat long-term capital gains rate. This change, effective from 23 July 2024, aims to simplify tax calculations and harmonize asset classes.\n\nFor properties sold before 23 July 2024, indexation allows for an adjusted cost of acquisition, reducing capital gains and tax liability. For example, a property sold for ₹7 crore, bought in 1990 for ₹50 lakh, would have indexed costs leading to capital gains of ₹3.37 crore and tax of ₹67.4 lakh. However, for transfers on or after 23 July 2024, the removal of indexation means the same property would show capital gains of ₹6 crore and tax of ₹75 lakh.\n\nAlso read | For property investors, one step forward and two steps back\n\nThe elimination of indexation may influence tax outflows depending on transaction specifics, affecting exemptions under Sections 54 and 54EC.\n\nThe Budget has also introduced taxing share buybacks as dividend income, aligning with existing dividend tax policies. Tax Collected at Source (TCS) on certain transactions can now be offset against Tax Deducted at Source (TDS) on salary income, effective 1 October 2024. Additionally, a proposed 1% TCS on “luxury\" goods exceeding ₹10 lakh will come into effect from 1 January 2025, with further details to be issued by the government.\n\nWith these sweeping changes, Union Budget 2024-25 introduces a range of new rules and opportunities, presenting both challenges and strategies for taxpayers to optimize their financial and tax planning.\n\nSonu Iyer, tax partner and national leader, People Advisory Services, EY India. Siddharth Deb, tax director, EY India, also contributed to the article.",
    "tags": [
      "In Charts",
      "#Money",
      "#personal finance"
    ],
    "nltk_summary": "With the unveiling of Union Budget 2024-25, personal finance is set for a transformation that promises both simplification and strategic shifts.\nRead this | How the Budget affects your salaries, investments and taxesThe Budget has proposed substantial changes to capital gains taxation.\nThe proposed long-term capital gains tax rate of 12.5% will apply uniformly across all asset classes, while short-term capital gains rates will increase from 15% to 20%.\nSpecified mutual funds now exclude gold ETFs and gold mutual funds, which will be taxed at 12.5% without indexation if held for over 12 months, starting FY26.\nFor properties sold before 23 July 2024, indexation allows for an adjusted cost of acquisition, reducing capital gains and tax liability.",
    "nltk_keywords": [
      "personal",
      "budget",
      "finance",
      "2024",
      "proposed",
      "gains",
      "mutual",
      "tax",
      "impact",
      "understanding",
      "property",
      "capital",
      "indexation",
      "funds"
    ]
  },
  {
    "title": "Moldova's finance minister accepts new job at central bank",
    "description": "(Reuters) - Moldovan Finance Minister Petru Rotaru will resign from government to serve as vice president of the country's central bank, a parliamentary speaker said on Thursday.",
    "partial_text": "Moldova’s finance minister accepts new job at central bank\n1 minute\n(Reuters) – Moldovan Finance Minister Petru Rotaru will resign from government to serve as vice president of the country’s central bank, a parliamentary speaker said on Thursday.\nPri... [390 chars]",
    "url": "https://www.swissinfo.ch/eng/moldova%27s-finance-minister-accepts-new-job-at-central-bank/84955240",
    "published_at": "2024-07-25T14:56:21+00:00",
    "media_source_name": "Swissinfo (EN)",
    "media_source_url": "www.swissinfo.ch/eng",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Moldova’s finance minister accepts new job at central bank\n\n1 minute\n\n(Reuters) – Moldovan Finance Minister Petru Rotaru will resign from government to serve as vice president of the country’s central bank, a parliamentary speaker said on Thursday.\n\nPrime Minister Dorin Recean plans to nominate a candidate for the ministerial post after parliament votes for Rotaru’s appointment next Wednesday, a government spokesperson said on Telegram.\n\nUntil the vote, Rotaru will continue his ministerial duties, the spokesperson added.\n\nRotaru led the finance ministry from September 2023. He previously served as a director of the country’s tax service.",
    "tags": [],
    "nltk_summary": "Moldova’s finance minister accepts new job at central bank1 minute(Reuters) – Moldovan Finance Minister Petru Rotaru will resign from government to serve as vice president of the country’s central bank, a parliamentary speaker said on Thursday.\nPrime Minister Dorin Recean plans to nominate a candidate for the ministerial post after parliament votes for Rotaru’s appointment next Wednesday, a government spokesperson said on Telegram.\nUntil the vote, Rotaru will continue his ministerial duties, the spokesperson added.\nRotaru led the finance ministry from September 2023.\nHe previously served as a director of the country’s tax service.",
    "nltk_keywords": [
      "finance",
      "job",
      "central",
      "spokesperson",
      "votes",
      "moldovas",
      "vote",
      "vice",
      "bank",
      "minister",
      "ministerial",
      "rotaru",
      "accepts",
      "countrys"
    ]
  },
  {
    "title": "Electoral Dysfunction Live: Sky News podcast announces live UK tour",
    "description": "During what will be a significant month in global politics, audiences can expect sharp dissection of the latest spin from Westminster and beyond, combined with plenty of lively discussion.",
    "partial_text": "Sky News' hugely popular politics podcast Electoral Dysfunction will go on tour in September after a busy summer covering the general election.\nA series of live shows around the UK will be hosted by Sky's political editor Beth Rigby.\nShe will be join... [2174 chars]",
    "url": "https://news.sky.com/story/electoral-dysfunction-live-sky-news-podcast-announces-live-uk-tour-13183460",
    "published_at": "2024-07-27T05:35:00+00:00",
    "media_source_name": "Sky News",
    "media_source_url": "news.sky.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Sky News' hugely popular politics podcast Electoral Dysfunction will go on tour in September after a busy summer covering the general election.\n\nA series of live shows around the UK will be hosted by Sky's political editor Beth Rigby.\n\nShe will be joined by regular panellist Ruth Davidson, who is a Conservative peer, and a number of special guests at the events in London, Salford, Liverpool and Glasgow.\n\nDuring the shows, audiences will get their chance to ask questions and get the panel's thoughts on the world of politics and podcasting.\n\nSpreaker Spreaker , which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enable Spreaker cookies or to allow those cookies just once. You can change your settings at any time via the This content is provided by, which may be using cookies and other technologies. To show you this content, we need your permission to use cookies. You can use the buttons below to amend your preferences to enablecookies or to allow those cookies just once. You can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Spreaker cookies. To view this content you can use the button below to allow Spreaker cookies for this session only. Enable Cookies Allow Cookies Once\n\n👉 Click here to follow Electoral Dysfunction wherever you get your podcasts 👈\n\nThe podcast has reached over two million downloads since it was launched earlier this year - and it regularly features at the top of the charts.\n\nFounding contributor and Labour MP Jess Phillips recorded her final episode earlier this month after being appointed a government minister.\n\nTickets are available here: aegp.uk/Electoral-Dysfunction\n\nElectoral Dysfunction Live, September dates:\n\nAdvertisement\n\n• London - Thursday 12th, Bloomsbury Theatre\n\n• Salford - Monday 16th, Lowry Quays\n\n• Liverpool - Sunday 22nd, St George's Hall\n\n• Glasgow - Thursday 26th, The Glee Club\n\nAudiences can expect sharp dissection of the latest spin from Westminster and beyond, combined with plenty of lively discussion.\n\nDuring what will be a significant time in global politics - with the UK a few months into a new government and the US election fast approaching - the team will discuss which politicians are succeeding, and who risks having a so-called \"electoral dysfunction\".",
    "tags": [
      "electoral dysfunction",
      "Ruth Davidson",
      "Podcasts",
      "Jess Phillips"
    ],
    "nltk_summary": "Sky News' hugely popular politics podcast Electoral Dysfunction will go on tour in September after a busy summer covering the general election.\nSpreaker Spreaker , which may be using cookies and other technologies.\nYou can use the buttons below to amend your preferences to enable Spreaker cookies or to allow those cookies just once.\nYou can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Spreaker cookies.\nTo view this content you can use the button below to allow Spreaker cookies for this session only.",
    "nltk_keywords": [
      "politics",
      "cookies",
      "podcast",
      "dysfunction",
      "using",
      "content",
      "allow",
      "live",
      "technologies",
      "announces",
      "tour",
      "uk",
      "spreaker",
      "sky",
      "electoral"
    ]
  },
  {
    "title": "Taxation and politics",
    "description": "Unintended consequences",
    "partial_text": "Sir, – The Department of Finance’s Tax Strategy Group report, presented this month, has shown the dramatic growth in income tax yield to this State over the past 10 years, growing from €10.5 billion in 2013 to €25.4 billion in 2023.\nThe Tax Strategy ... [2769 chars]",
    "url": "https://www.irishtimes.com/opinion/letters/2024/07/27/taxation-and-politics/",
    "published_at": "2024-07-26T23:08:00+00:00",
    "media_source_name": "The Irish Times",
    "media_source_url": "www.irishtimes.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Sir, – The Department of Finance’s Tax Strategy Group report, presented this month, has shown the dramatic growth in income tax yield to this State over the past 10 years, growing from €10.5 billion in 2013 to €25.4 billion in 2023.\n\nThe Tax Strategy Group says that 7 per cent of all taxpayers are exempt from income tax this year, 64 per cent of taxpayers pay the standard (lower) rate of income tax but circa one million of these taxpayers’ income tax liability is fully covered by their tax credits, and that only 29 per cent of taxpayers pay the higher rate of income tax. Most noteworthy of all, the top 5 per cent of taxpayers will pay 48.5 per cent of all income tax and USC this year and the top 1 per cent will pay 24.4 per cent, illustrating a huge imbalance and concentration vulnerability in our highly progressive taxation system. It further points to the strongly redistributive nature of the tax and welfare system in Ireland.\n\nThe Tax Strategy Group therefore warns that this income tax concentration risk is such “that high marginal tax rates may have adverse consequences inter alia for work incentives and competitiveness including the ability to attract inward investment”.\n\nIreland’s left-wing parties intend to increase this risk if in government. For example, Sinn Féin’s taxation plans would be punitive for higher earning employees of multinational companies, and highly uncompetitive on a Europe-wide basis, for all higher-earning employees in this State. Sinn Féin plans to remove tax credits on incomes above €100,000 and introduce a punishing new 3 per cent tax on incomes above €140,000, on top of all the existing taxes, ignoring the warnings of the Department of Finance. The party also plans to significantly increase employers’ PRSI for higher earners and to reduce the standard fund threshold for private pensions, hitting employers and those who cater for their own private pension. Sinn Féin also plans to increase the rate of capital acquisitions tax to 36 per cent, levying more inheritance tax on children of deceased parents. The party says it is in favour of a new annual wealth tax, a tax that is likely to drive investment and wealth out of our highly open Irish economy. Sinn Féin also says it will also increase stamp duty on higher valued residential properties.\n\nREAD MORE\n\nSurely we cannot expect that multinational firms and their high-earning employees will be willing to locate in a country where the primary objective of leftist taxation policy is to make the few pay for the many to an even greater extent than they already do. The international mobility at the higher earning segment of the labour market presents a very significant risk that the highest quality jobs are at risk of locating elsewhere.\n\nThe taxation plans not just of Sinn Féin, but also Labour, the Social Democrats and People Before Profit, all of which want more tax levied on those who already pay most, could have a real impact on our economy if in government. – Yours, etc,\n\nMARK MOHAN,\n\nDublin 15.",
    "tags": [
      "Pricewatch",
      "Beauty"
    ],
    "nltk_summary": "Sir, – The Department of Finance’s Tax Strategy Group report, presented this month, has shown the dramatic growth in income tax yield to this State over the past 10 years, growing from €10.5 billion in 2013 to €25.4 billion in 2023.\nMost noteworthy of all, the top 5 per cent of taxpayers will pay 48.5 per cent of all income tax and USC this year and the top 1 per cent will pay 24.4 per cent, illustrating a huge imbalance and concentration vulnerability in our highly progressive taxation system.\nFor example, Sinn Féin’s taxation plans would be punitive for higher earning employees of multinational companies, and highly uncompetitive on a Europe-wide basis, for all higher-earning employees in this State.\nSinn Féin also plans to increase the rate of capital acquisitions tax to 36 per cent, levying more inheritance tax on children of deceased parents.\nThe taxation plans not just of Sinn Féin, but also Labour, the Social Democrats and People Before Profit, all of which want more tax levied on those who already pay most, could have a real impact on our economy if in government.",
    "nltk_keywords": [
      "politics",
      "risk",
      "income",
      "plans",
      "pay",
      "cent",
      "sinn",
      "taxation",
      "tax",
      "taxpayers",
      "higher"
    ]
  },
  {
    "title": "Why at CM Chandrababu Naidu’s call, 160-odd MLAs stood up in Andhra Assembly",
    "description": "TDP chief, who has accused former CM Jagan Mohan Reddy of “vendetta politics” asked all those who had faced cases under the YSRCP govt to stand up. Almost all were on their feet barring YSRCP’s five",
    "partial_text": "AS FAR as messages go, Chief Minister N Chandrababu Naidu could not have planned one with more symbolism. During the Andhra Pradesh Assembly proceedings Thursday, the Telugu Desam Party (TDP) chief asked all MLAs who had cases lodged against them by ... [5326 chars]",
    "url": "https://indianexpress.com/article/political-pulse/cm-chandrababu-naidu-call-mlas-stood-up-andhra-assembly-9477838/",
    "published_at": "2024-07-26T15:23:21+00:00",
    "media_source_name": "The Indian Express",
    "media_source_url": "indianexpress.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "AS FAR as messages go, Chief Minister N Chandrababu Naidu could not have planned one with more symbolism. During the Andhra Pradesh Assembly proceedings Thursday, the Telugu Desam Party (TDP) chief asked all MLAs who had cases lodged against them by the previous YSR Congress Party (YSRCP) government to stand up. Nearly 160 MLAs were soon on their feet, with the only ones who remained seated being the five members of the YSRCP. Party chief and former CM Y S Jagan Mohan Reddy was not present in the House.\n\nThose who stood up included TDP MLAs and those of its ruling alliance partners, the JanaSena Party (JSP) and BJP. C Ayyanna Patrudu, who also faced cases under the previous regime, would have also stood up but remained seated as he is now the Speaker.\n\nNaidu, who has accused Jagan of using the police and other state agencies for “vendetta politics”, himself faced several cases under the YSRCP government. For one such case, an alleged scam in the Skill Development Corporation, the TDP chief was arrested on September 9 last year and was in jail for 53 days before getting bail. According to the Andhra Pradesh branch of the Crime Investigation Department at the time, at least Rs 241 crore earmarked for the corporation was allegedly diverted to five shell companies.\n\nAdvertisement\n\nThe others who faced cases under the YSRCP government and stood up at Naidu’s urging included JSP chief K Pawan Kalyan; Narayana Group of Educational Institutions founder P Narayana; former TDP state chief K Atchannaidu; Naidu’s son Nara Lokesh; former TDP state ministers K Kalavenkata Rao, N Chinarajappa; former YSRCP MP and now TDP MLA K Raghu Ramakrishna Raju; Mines and Geology Minister Kollu Ravindra; former TDP general secretary Bonda Umamaheswara Rao; former TDP whip D Narendra Kumar; and Finance Minister Payyavula Keshav.\n\nBefore CM Naidu got those with cases against them to stand up, he presented a document in the Assembly claiming that 591 TDP leaders had faced prosecution under the Jagan dispensation between 2019 and 2024, of whom 162 were arrested. The document also claimed that 24 JSP, 16 BJP and 12 Congress leaders also faced cases. There are no convictions on record.\n\nAs per the document, among those elected MLAs again this time, Chintamaneni Prabhakar has the most cases against him as well as instances of arrest, at 48 and 15, respectively. Five leaders had at least 20 cases against them; Chandrababu Naidu and his son faced 17 cases each.\n\nJ C Prabhakar Reddy of the TDP, who is now a former MLA, however, tops the list, with 66 cases lodged against him under the YSRCP government, with 46 arrests.\n\nAdvertisement\n\nMost of the former ministers and TDP MLAs who had cases lodged against them between 2014 and 2019 were named for alleged insider trading over land in the Amaravati capital region or during the realignment of Amaravati capital boundaries to benefit some landlords.\n\nPawan Kalyan was booked for rash and negligent driving in November 2022 after he climbed atop his speeding SUV as attempts were made to stop him from reaching a protest site at Ippatam village in Guntur district.\n\nIn 2022, P Narayana found himself behind bars after the government alleged that a teacher at one of his institutions leaked a question paper. He was granted bail within a few hours after it emerged that the teacher had taken a photo of the question paper several minutes after it was given to students and circulated it. In 2020, K Atchannaidu was arrested in connection to an alleged scam in the purchase of drugs and other material in the Employees’ State Insurance (ESI) hospitals and dispensaries.\n\nState Home Minister V Anitha and former TDP MLA J C Diwakar Reddy were booked under the Scheduled Caste and Scheduled Tribe (Prevention of Atrocities) Act after allegations emerged that the leader intimidated and threatened someone. Several other MLAs were booked under sections 143 (unlawful assembly), 353 (assault of criminal force to deter a public servant) and 149 (offence by any member of an unlawful assembly).\n\n“It was funny. When (Chandrababu Naidu) asked in the House (on Thursday) how many of us had at least one case filed against us by Jagan, several MLAs raised their hands and then stood up and looked to their left or right and giggled as everyone was standing. Jagan did not spare anyone, everyone associated with TDP was booked in one case or the other,” Umamaheswara Rao said.\n\nAdvertisement\n\nNaidu, who had in November 2021 walked out of the Assembly in protest against the behaviour of YSRCP MLAs and alleged that his wife was the target of character assassination by the YSRCP, had vowed to bring back “decorum” and “dignity” to the House if his party returned to power. Sources said that in spite of the TDP-led NDA having a brute majority, with 164 seats in the 175-member Assembly, there has been no heckling of the YSRCP MLAs, most of whom have skipped the sessions so far.\n\nOn Friday, Jagan came under attack for camping in New Delhi to organise protests alleging law and order issues in the state after the TDP came to power in June. After YSRCP MLAs raised the matter of their party’s leader facing attacks, state Home Minister V Anitha asked why Jagan was absent when such a crucial matter was to be discussed. “I want to know the names and details of the 36 persons that Jagan says have been killed due to political vendettas. Why is no one able to give that information? Instead of staging a drama in Delhi and tarnishing the image of the state, the YSRCP should provide the details. We will investigate and take action,” she said.",
    "tags": [],
    "nltk_summary": "AS FAR as messages go, Chief Minister N Chandrababu Naidu could not have planned one with more symbolism.\nDuring the Andhra Pradesh Assembly proceedings Thursday, the Telugu Desam Party (TDP) chief asked all MLAs who had cases lodged against them by the previous YSR Congress Party (YSRCP) government to stand up.\nParty chief and former CM Y S Jagan Mohan Reddy was not present in the House.\nThose who stood up included TDP MLAs and those of its ruling alliance partners, the JanaSena Party (JSP) and BJP.\nC Ayyanna Patrudu, who also faced cases under the previous regime, would have also stood up but remained seated as he is now the Speaker.",
    "nltk_keywords": [
      "jagan",
      "chief",
      "cm",
      "andhra",
      "160odd",
      "party",
      "chandrababu",
      "naidus",
      "cases",
      "stood",
      "minister",
      "ysrcp",
      "state",
      "mlas",
      "assembly",
      "faced",
      "tdp"
    ]
  },
  {
    "title": "‘Selina was not modelled on Harris’: Iannucci on how US presidential race came to mirror Veep",
    "description": "Writer says cyclical nature of politics allows satire to appear to predict future, including vice-president’s run for top job",
    "partial_text": "For years, British politics has echoed the ludicrous and sometimes concerning storylines of Armando Iannucci’s TV show The Thick of It. Now, with the US vice-president, Kamala Harris, campaigning to become the commander-in-chief, Americans are using ... [5357 chars]",
    "url": "https://www.theguardian.com/tv-and-radio/article/2024/jul/26/selina-meyer-was-not-modelled-on-kamala-harris-armando-iannucci-veep-us-presidential-race",
    "published_at": "2024-07-26T13:06:10+00:00",
    "media_source_name": "The Guardian",
    "media_source_url": "www.theguardian.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "For years, British politics has echoed the ludicrous and sometimes concerning storylines of Armando Iannucci’s TV show The Thick of It. Now, with the US vice-president, Kamala Harris, campaigning to become the commander-in-chief, Americans are using the show Veep as proof of the satirist’s gift for prophecy.\n\nSo what does Iannucci think about being dubbed the Nostradamus of western politics?\n\n“Well, I knew that was going to happen,” he joked.\n\nViewership of Veep, which tells the story of Selina Meyer’s never-ending struggle to move up from the vice-presidency, rose by more than 350% this week – with audiences drawing countless parallels between Harris and Julia Louis-Dreyfus’s character. “Was the HBO show Veep just a documentary filmed in the past about the future?” one X user asked.\n\nIannucci, who has worked in television satire for decades, points to the cyclical nature of news as a way of predicting what is around the corner.\n\n“If you look at early episodes of [the 80s British sitcom] Yes Minister, it’s all about Europe, cuts, the NHS. These themes don’t go away. Ministerial cockups take the same form again and again and again,” he said.\n\n“Even with fiction, if you’ve got the research right, reality will always shine through,” he added. “When we made Veep we spent a lot of time talking to the vice-president’s office, the west wing, state departments, senators. The actors met their counterparts in Washington. So you get a rough idea of what the terrain is going to be like.”\n\nFor the writer, it was just a case of taking real-life occurrences and “pushing it in as stupid a direction as it could go”.\n\nAmong the clips and gifs going viral from the series is a scene in which Meyer enters a room and breathlessly informs her closest advisers that the president has decided not to run for a second term. “I’m gonna run for president!” she shrieks to cheers and applause.\n\nThough Iannucci likens Meyer’s vanity and vindictiveness to Donald Trump’s, fans are enjoying comparing Harris’s awkward speeches and delivery style with her fictional counterpart – from her now infamous coconut speech to her slogan: “What can be, unburdened by what has been”.\n\n“I wouldn’t want people to think that Selina was in any way modelled on Harris,” Iannucci said. “But I suppose [the comparisons] are inevitable. They have the same kind of career. Selena was a senator like Harris, and is then plucked from a powerful job into a job that’s frustratingly powerless.”\n\nHe said the role of vice-president was determined by the president. “That’s why we chose it as a way into the comedy, because it has that ‘so near and yet so far’ tension.”\n\nDuring its run on HBO from 2012 to 2019, Veep won 17 Emmys, including three for outstanding comedy series. Iannucci said part of the motivation was to show the “individual human beings inside these big, grand buildings”, who are good at some things and not so much at others.\n\n“We were making the show when Joe Biden was vice-president. Somebody on his team told us: ‘The thing about being vice-president is, one, the vice-president always thinks they can do a better job than the president, and two, the vice-president knows that when they leave a room everyone’s making jokes about them.’\n\n“Al Gore actually told us that he’d found out there was a big Hollywood premiere on at the White House and realised he wasn’t on the list. He couldn’t ask about the list because that might look desperate, so he just made other arrangements.”\n\nIannucci said he believed many people would now be energised into getting involved in Harris’s campaign and voting because they were “desperate for something different”.\n\n“With social media, we fall into the trap of thinking the loudest person must be the most popular, whereas in fact they’re not,” he said. “Yes, there’s a huge part of America that worships Trump, but there’s also a far larger part that totally abhors him. Now, because a potential way through has emerged, it’s almost like a weight has come off a lot of people’s shoulders.”\n\nHe noted that the political landscape had completely shifted since he first began satirising it. Shows such as The Thick of It assumed there was a set of rules to be followed, but scandals such as Partygate had disproved that notion.\n\n“There are no rules. Trump said: ‘I could shoot a guy on Fifth Avenue and still get elected’. Trump is an entertainer, Boris Johnson was an entertainer,” he said. “The comedy is coming direct from them, and the best comedians become kind of inquisitors – like John Oliver or Jon Stewart, who just tell you the facts in a funny way.”\n\nOf course, new governments present new opportunities, but Iannucci said it takes time to figure out a new administration’s methodology and tone. As patron of the Child Poverty Action Group, he watched closely this week’s vote on the two-child benefit cap in parliament.\n\n“It’s so frustrating, because everyone knows scrapping the cap is the most effective way to bring the largest number of children out of poverty,” he said.\n\n“The other frustrating thing is you kind of know [Labour] want to scrap it at some stage. It’s great that the issue’s being raised in parliament, but it’s important it doesn’t become a ‘who’s going to blink first’ competition. I don’t want it to become Keir Starmer’s Rwanda, where he sticks with it because he’s been given little room for manoeuvre.”\n\nIn US politics, Iannucci hopes Harris – who has previously said she is a fan of Veep – can triumph over Trump in what he calls a “mighty important election”.\n\nWhile he hasn’t observed Harris up close, he said “we’re about to find out what she’s like, because there’s really nowhere for her to hide”.",
    "tags": [],
    "nltk_summary": "Now, with the US vice-president, Kamala Harris, campaigning to become the commander-in-chief, Americans are using the show Veep as proof of the satirist’s gift for prophecy.\n“Was the HBO show Veep just a documentary filmed in the past about the future?” one X user asked.\n“When we made Veep we spent a lot of time talking to the vice-president’s office, the west wing, state departments, senators.\n“I wouldn’t want people to think that Selina was in any way modelled on Harris,” Iannucci said.\n“Yes, there’s a huge part of America that worships Trump, but there’s also a far larger part that totally abhors him.",
    "nltk_keywords": [
      "iannucci",
      "way",
      "race",
      "going",
      "run",
      "presidential",
      "vicepresident",
      "president",
      "trump",
      "theres",
      "selina",
      "veep",
      "modelled",
      "harris",
      "mirror",
      "came"
    ]
  },
  {
    "title": "Macron has pulled off the unbelievable-advance leadership throughout 2024 Paris Olympics",
    "description": "A stable Emmanuel Macron at the helm of French politics is good news for Europe and its partners the world over, especially New Delhi.",
    "partial_text": "The soft power element of the French nation is on glorious display as the country is set for the grand opening of the Olympic Games today, 26 July 2024.\nHe has cleverly stopped both the far Right and the far Left from taking political leadership, usi... [8591 chars]",
    "url": "https://theprint.in/opinion/macron-has-pulled-off-the-unbelievable-advance-leadership-throughout-2024-paris-olympics/2192383/",
    "published_at": "2024-07-26T08:19:30+00:00",
    "media_source_name": "ThePrint",
    "media_source_url": "theprint.in",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "The soft power element of the French nation is on glorious display as the country is set for the grand opening of the Olympic Games today, 26 July 2024.\n\nHe has cleverly stopped both the far Right and the far Left from taking political leadership, using the political inertia to further his leadership of the country during the Olympic Games 2024 – with an unprecedented element of Indian support.\n\nEmmanuel Macron has pulled off the unbelievable with an audacity that would have cost anyone else dearly in his place. Remarkable political acumen has enabled him to emerge as the only bankable force in France even after losing electoral support in the recently concluded snap elections.\n\nThis massive boost to Paris’ soft power comes at a time when its influence in the French overseas territories in the Indo-Pacific has lately declined. Despite the melancholia that has descended the continent due to demands for security modernisation and the defence industry ramp-up, the palpable excitement among Parisians is unmissable. Equally unmissable are the thousands of security personnel guarding the games.\n\nThe Indian connection\n\nThe India-France bonhomie has been on fine display, with an Indian element shouldering security arrangements.\n\nIndia’s celebrated dog squad, the K-9, has debuted internationally at the Paris Olympics. It is noted for its contribution toward carrying out security manoeuvres at the G-20 and the 2024 Republic Day celebrations. These elite dog squads are accompanied by personnel and handlers from different Central Armed Forces such as the Indo-Tibetan Border Police (ITBP), National Security Guard (NSG), and the Central Reserve Police Force (CRPF), to name a few.\n\nParis has been on high alert after the recent terror attacks in Moscow where ISIS-K killed about 140 people. France has also been a victim of terror attacks – in 2015 in Paris and in 2016 in Nice. To secure the Olympic games this year, the country decided to deploy an overwhelming number of police officers, private security personnel and soldiers.\n\nIndia’s K–9 squad will be deploying its prowess and working alongside at least 45,000 police officers and 20,000 private security personnel to especially guard the grand opening ceremony on the Seine River. Paris has decided against the standard practice of holding the opening ceremony at a stadium, choosing instead the River Seine with the picturesque backdrop of the Eiffel Tower.\n\nAlso read: Macron’s snap election call could be his gravest undoing. It can’t save him from ‘cohabitation’\n\nBan on Russia\n\nAs the Russia-Ukraine war shows no signs of abating, the European solidarity with Ukraine is very much on display in the games. Following the Russian invasion in 2022, the International Olympic Committee decided to levy a technical ban on Russia and Belarus at the Paris Olympics. Fifteen Russian and 18 Belarusian athletes, who have been vetted to ensure no connection with the Russian military, will be competing in the games.\n\nHowever, they will not be competing as official entries from Moscow or Minsk but under the category of ‘Individual Neutral Athletes’. Under this classification, Russian and Belarusian flags, national anthems and uniforms will be absent from the games and its proceedings. Additionally, Russia is excluded from all kinds of team events in about 30 sports.\n\nIn contrast to an ousted Russia, Ukraine is participating in the Paris Olympics with a 140-member team, one of the smallest contingents to have participated in any Olympic games after the country’s independence in 1991.\n\nThe Paris Olympics have also been getting a lot of eyeballs for having a remarkably lean budget. In comparison to the previously held Olympics, the 2024 Paris Olympics have been financed with a budget of just about $10 billion, the leanest to date, gaining rightful applause.\n\nAlso read: As another Trump era looms, NATO’s Ukraine challenge and India’s diplomatic dance\n\nUnsettled question of French political leadership\n\nThe question of leadership remains unsettled in France. It is a Centrist caretaker government that is overseeing these preparations for the Olympics. Once the games are over, the process of choosing the Prime Minister will restart from where it was left.\n\nSo far, Macron has gotten away with audacious decisions that most political experts predicted would fail.\n\nHe has acknowledged the French people’s choice evidenced by the European elections where the far Right got double the vote Macron could. He called for a snap election when he didn’t have to. Back then it seemed more like a tantrum that would shoot Macron in his foot as the popularity of the far Right was surging and his own was dipping. The results of the first round confirmed that shortly.\n\nDefying all political advice, he simply disappeared from the public eye, into the folds of the quaint Elysee palace. There, he masterminded another plan for stopping the far Right from winning the election despite the front’s popularity.\n\nJust as Marine Le Pen’s National Rally camp was going berserk with its astounding performance in the first round of snap elections, he made it possible for 224 candidates to withdraw. This would allow the anti-far Right vote to consolidate to the desired effect. When the results of the second round were announced, Macron stood vindicated.\n\nSuddenly, the French parliamentary election results swung from the far Right to the far Left as the latter coalition, the New Popular Front, finished first.\n\nBut that’s not all.\n\nJust as the far Left camp started to celebrate this rather unbelievable luck at the polls, fantasising about a new far Left PM for France, Macron pulled away that opportunity from their hands.\n\nWhere exactly is French politics going with this political ménage à trois of Macron, the far Right and the far Left?\n\nOnce the Olympic games conclude, Macron will be faced with two situations—to enter a cohabitation with the Left alliance (consisting of two far Right and two moderate Left parties) or, build a coalition to avoid cohabitation.\n\nRemember that unlike two weeks ago, when a co-habitation looked impossible to forego, Macron yet again is poised to manage a coalition instead and rule France in his signature style of intelligence, audacity and charm.\n\nAlso read: What prompted India’s balancing act in Switzerland? Ukraine peace summit’s wrong messaging\n\nA ‘short-term’ genius\n\nDays before the Paris Olympics, Macron’s Renaissance party formed a last-minute agreement with several Centre-Right MPs and won a key vote in the Parliament. This tactical victory has enabled the French president, usually tasked with the country’s foreign policy, security and defence, to play a more tangible role in forming the next government.\n\nThis has not only consolidated his hold on the domestic part of French politics but has also delivered the final checkmate to the far Right and the far Left at the same time.\n\nThe far Left is left with their moment of reckoning to realise how they never had a plan or a leader in the first place.\n\nOn the other hand, Jordan Bardella, the far Right camp’s poster boy, is frustrated by his thwarted chances of becoming the PM. Thus, he has assumed leadership of the new far Right front put together by Hungarian PM Viktor Orban. The convergence between the French far Right and Orban, which was fractured until now on the question of Ukraine and European security, has been blurred by Bardella’s latest outing. In the short term, this will cost the far Right their support in France where public opinion is still overwhelmingly in support of Ukraine.\n\nBut it also signals how the Opposition is not looking at the short term anymore.\n\nUnable to defeat the political genius of Emmanuel Macron – at a time when his approval ratings and popularity were at their lowest – they would rather make a comeback when his political career ends in 2027.\n\nPrecisely for the same reasons, Macron’s calculus is to hold on to power until 2027, after which his political career will end anyway. What he has done until then is to make sure that his role as a president is not overshadowed by a PM from another political ideology.\n\nIn the long run, however, it could raise genuine questions about his legacy. His successor Gabriel Attal couldn’t play a visible enough role in his capacity as PM. Attal’s popularity is not even close to that of Bardella, the successor of Le Pen.\n\nHowever, a stable Macron at the helm of French politics is good news for Europe and its partners the world over, especially New Delhi. The continuity will further enable speedier achievement of strategic goals and perhaps also play a more visible role in lessening geopolitical uncertainty.\n\nThe writer is an Associate Fellow, Europe and Eurasia Center, at the Manohar Parrikar Institute for Defence Studies and Analyses. She tweets @swasrao. Views are personal.\n\n(Edited by Zoya Bhatti)",
    "tags": [
      "Emmanuel Macron",
      "Macron",
      "France",
      "Paris Olympics"
    ],
    "nltk_summary": "India’s celebrated dog squad, the K-9, has debuted internationally at the Paris Olympics.\nFollowing the Russian invasion in 2022, the International Olympic Committee decided to levy a technical ban on Russia and Belarus at the Paris Olympics.\nThe Paris Olympics have also been getting a lot of eyeballs for having a remarkably lean budget.\nIn comparison to the previously held Olympics, the 2024 Paris Olympics have been financed with a budget of just about $10 billion, the leanest to date, gaining rightful applause.\nThus, he has assumed leadership of the new far Right front put together by Hungarian PM Viktor Orban.",
    "nltk_keywords": [
      "unbelievableadvance",
      "pulled",
      "2024",
      "left",
      "security",
      "political",
      "olympics",
      "paris",
      "right",
      "games",
      "leadership",
      "french",
      "far",
      "macron"
    ]
  },
  {
    "title": "Vietnam Communist Party chief's funeral draws thousands of mourners, including world leaders",
    "description": "Thousands of mourners gathered in Hanoi for the second day of the funeral of the man who dominated Vietnamese politics for over a decade, Communist Party general secretary Nguyen Phu Trong.",
    "partial_text": "People line up to visit the national funeral house to pay respects to Vietnam's General Secretary of the Communist Party Nguyen Phu Trong in Hanoi, Vietnam, Friday, July 26, 2024. (AP Photo/Minh Hoang)\nHANOI – Thousands of mourners gathered in Hanoi ... [4082 chars]",
    "url": "https://www.clickondetroit.com/news/world/2024/07/26/vietnam-communist-party-chiefs-funeral-draws-thousands-of-mourners-including-world-leaders/",
    "published_at": "2024-07-26T04:44:39+00:00",
    "media_source_name": "WDIV ClickOnDetroit",
    "media_source_url": "www.clickondetroit.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "A woman mourns during the state funeral of Vietnam's late General Secretary of the Communist Party Nguyen Phu Trong in Hanoi, Vietnam, Friday, July 26, 2024. (AP Photo/Minh Hoang)\n\nHANOI – Thousands of mourners gathered in Hanoi on Friday for the second day of the funeral of the man who dominated Vietnamese politics for over a decade, Communist Party general secretary Nguyen Phu Trong.\n\nHis death, at 80, last week in Hanoi marked the start of a succession struggle within the party that will likely to continue until the all-important National Party Congress of Vietnam’s Communist Party in 2026.\n\nRecommended Videos\n\nTrong’s coffin, draped in the red and yellow of Vietnam’s flag, was laid beneath his smiling portrait and dozens of medals at the National Funeral House in Hanoi on Thursday. All flags in the southeast Asian nation flew at half mast during the two-day period of national mourning, while all sports and entertainment were suspended.\n\nHe will be buried at Mai Dich cemetery, the final resting place for military heroes and senior party officials, later on Friday.\n\nTop Communist Party officials paid tribute, including President To Lam, who took over as caretaker general secretary a day before Trong’s death was announced. Thousands of people, many of whom who had traveled from far-flung provinces, queued up in Hanoi late into Thursday to light incense and pay their respects.\n\nPolitburo member Luong Cuong said Thursday that his death was “an extremely huge, irreparable loss to the Party, the state, the people and his family.”\n\nSouth Korean Prime Minister Han Duck-soo; Wang Huning, the fourth-ranked leader in the Chinese Communist Party; former Japanese Prime Minister Yoshihide Suga; Cuban National Assembly President Esteban Lazo Hernandez; and Indian National Security Advisor Ajit Doval were among those in attendance on Thursday.\n\nU.S. president Joe Biden had said earlier that Trong was a “champion of the deep ties” between Americans and the Vietnamese.\n\nRussian President Vladimir Putin said in a statement on Telegram that Trong would be remembered as a “true friend” of Russia who made a “great personal contribution” to the improvement of ties between the two nations.\n\nTrong, who studied in the Soviet Union from 1981 to 1983, was the first Vietnamese Communist Party chief to visit the White House. He advocated a pragmatic foreign policy of “bamboo diplomacy,” a phrase he coined that refers to the plant’s flexibility, bending but not breaking in the shifting headwinds of geopolitics.\n\nVietnam is unlikely to abandon that approach, under which it has pursued pragmatic cooperation with its much larger and more powerful neighbor China while maintaining good ties with other countries like the U.S., Japan and India, said Gregory B. Poling, who heads the Southeast Asia Program at the Center for Strategic and International Studies.\n\nTrong, a Marxist-Leninist ideologue, viewed corruption as the single gravest threat to the party’s legitimacy. He launched a sweeping anti-corruption campaign known as “blazing furnace,” which has singed both business and political elites.\n\nSince 2016, thousands of party officials have been disciplined. They included former presidents Nguyen Xuan Phuc and Vo Van Thuong and the former head of parliament, Vuong Dinh Hue. In all, eight members of the powerful Politburo were ousted on corruption allegations, compared to none between 1986 and 2016.\n\nThe anti-graft campaign was led by then-top security official To Lam until he was made president in May after his predecessor resigned amid corruption allegations.\n\nLam is likely to keep playing a dual role as the President and the caretaker party chief until 2026, said Poling. He added that Lam is the current favorite to get a full term as Trong's successor, but there is no guarantee.\n\nAlso unclear is what direction the anti-corruption movement will take in the short term without Trong. “But in the long term, it does seem like it’ll inevitably wind down because it was so linked to his legacy, his program.” He said.\n\nPoling also said that without a leader of Trong’s stature, different factions in the party may struggle to resolve their differences.\n\n“They’ll have to figure out what the future looks like, which is a necessary first step to passing on power to the next generation,” he said.",
    "tags": [
      "Lions",
      "Spartans",
      "Han Duck-soo",
      "Wolverines",
      "Dine In The D",
      "Elections",
      "Tigers",
      "A Conversation With",
      "Brag Book",
      "Weather News",
      "Trust Index",
      "Olympics",
      "In Your Neighborhood",
      "World news",
      "Money Minute",
      "Fireworks",
      "Travel",
      "Tasty Tuesday",
      "Postcards from Paris",
      "Olympics Schedule & Results",
      "What's The Buzz",
      "What's In That Garage",
      "4YI",
      "Forecasting Change",
      "Parade",
      "Red Wings",
      "Yoshihide Suga",
      "Esteban Lazo Hernandez",
      "Pistons",
      "Games People Play"
    ],
    "nltk_summary": "A woman mourns during the state funeral of Vietnam's late General Secretary of the Communist Party Nguyen Phu Trong in Hanoi, Vietnam, Friday, July 26, 2024.\n(AP Photo/Minh Hoang)HANOI – Thousands of mourners gathered in Hanoi on Friday for the second day of the funeral of the man who dominated Vietnamese politics for over a decade, Communist Party general secretary Nguyen Phu Trong.\nHis death, at 80, last week in Hanoi marked the start of a succession struggle within the party that will likely to continue until the all-important National Party Congress of Vietnam’s Communist Party in 2026.\nTop Communist Party officials paid tribute, including President To Lam, who took over as caretaker general secretary a day before Trong’s death was announced.\nTrong, who studied in the Soviet Union from 1981 to 1983, was the first Vietnamese Communist Party chief to visit the White House.",
    "nltk_keywords": [
      "including",
      "thousands",
      "world",
      "funeral",
      "party",
      "mourners",
      "leaders",
      "trong",
      "president",
      "hanoi",
      "draws",
      "vietnam",
      "vietnams",
      "trongs",
      "ties",
      "national",
      "communist"
    ]
  },
  {
    "title": "How Nikki Haley voters view the Harris-Trump matchup: From the Politics Desk",
    "description": "How Nikki Haley's 2024 GOP primary voters are viewing the general election matchup between Kamala Harris and Donald Trump after Joe Biden stepped aside.",
    "partial_text": "Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill.\nIn today’s edition, national politica... [6135 chars]",
    "url": "https://www.nbcnews.com/politics/haley-voters-harris-trump-matchup-politics-desk-rcna163732",
    "published_at": "2024-07-25T21:08:09+00:00",
    "media_source_name": "NBC News",
    "media_source_url": "www.nbcnews.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill.\n\nIn today’s edition, national political reporter Ben Kamisar breaks down our latest NBC News Deciders Focus Group series with Nikki Haley's primary voters. Plus, senior national political reporter Jonathan Allen .\n\nSign up to receive this newsletter in your inbox every weekday here.\n\nHaley voters confront a new choice with the same skepticism\n\nBy Ben Kamisar\n\nOver little more than a week, former President Donald Trump survived an assassination attempt, President Joe Biden decided not to seek another term and Vice President Kamala Harris became the de facto Democratic nominee.\n\nAnd yet, a new focus group of a key set of potential swing voters — supporters of Nikki Haley in the 2024 GOP primaries — illustrates just how hardened views of the election are.\n\nThose who applauded Trump for adopting a conciliatory tone in the immediate aftermath of the July 13 shooting now feel that he has reverted to being the candidate they previously opposed. Those who said they would vote for the Democratic presidential nominee in the fall were already on board with the party before Biden’s announcement. And those who were on the fence regarding the general election still feel like they are stuck there.\n\nThe conversations — as part of the NBC News Deciders Focus Group series, produced in collaboration with Engagious, Syracuse University and Sago — show that this group of voters, who cast ballots against Trump’s Republican coronation earlier this year, are by and large unhappy with their choices in the fall.\n\nThree participants plan to vote for Democrats again, just like they did in 2020. One currently plans not to vote. The remaining 10 focus group participants evenly split their votes between Trump and third-party candidates, either reluctantly choosing the former president because of their broader support for GOP policies or choosing a protest vote to signal their frustration with the direction of the party.\n\n“It may depend on where the tears fall on the ballot to determine who I cast my vote for,” said Audra B., a 53-year-old from Arizona, speaking about the choice between Trump and Harris. “I don’t like either one of them, but I’m also not going to not have my chance to vote. There are a lot of women who came before me to make sure I get this opportunity, and I don’t want to squander that.”\n\nAfter eyeing both major party candidates and the third-party options, Audra said she’s currently planning to back Libertarian Chase Oliver after voting for Trump in 2020.\n\nRead more from our focus group →\n\nShapiro gets a dual boost in the veepstakes\n\nPennsylvania Gov. Josh Shapiro’s vice presidential prospects are receiving a boost from expected — and unexpected — places.\n\nEmma Barnett and Brennan Leach report Shapiro’s in-state allies are making an especially public and vocal push to elevate their governor as Harris kicks off her search. The Philadelphia Democratic Party, for instance, explicitly endorsed a Harris-Shapiro ticket.\n\nFormer Rep. Bob Brady, the chair of the Philadelphia Democratic Party, said that with Shapiro on board, Harris would win Pennsylvania, a critical swing state.\n\n“I don’t guarantee anything, but I will guarantee that,” said Brady. “No question about it. We’re so enthused, so riled up.”\n\nMeanwhile, Republicans see Shapiro as the VP contender most likely to offer Harris a boost and make their efforts trickier, Allan Smith, Henry J. Gomez and Katherine Doyle report.\n\nThese Republicans say that Shapiro could help broaden Harris’ appeal with independent voters and traditional Democrats who are drifting away from the party, without completely alienating Republicans\n\n“I just think Shapiro is super strong,” one Trump ally said. “And Republicans should be concerned about it. If I were her, that would be the pick.”\n\nThe most important factor in Harris’ VP search\n\nBy Jonathan Allen\n\nPresidential campaigns like to sound noble about choosing a running mate. They talk about criteria like who is most fit to run the country, who would be a good governing partner and who can be plucked from their job without costing the party a Senate seat or a governorship.\n\nBut there’s only one factor that will matter as Harris makes her pick — especially if, as Democrats keep telling us, democracy itself is on the ballot: who is most likely to help her win.\n\nSure, that can be framed in the reverse — which contender does the least harm — and it often is. And part of that analysis must include whether voters see the would-be VP as ready to lead.\n\nBut make no mistake: This is a decision about cold, hard politics. Harris just watched her party force Biden off the ballot because of the threat of losing. She can be dead certain Democrats have the stomach for just about anything when it comes to beating Trump.\n\nWhat they won’t stand for is picking the best governing partner, someone she has a personal relationship with, a senator from a state with a Democratic governor or a governor from a state with a Democratic lieutenant governor if that person costs them the White House.\n\nIn the Trump era, voters in both parties have become far more comfortable with, and accustomed to, raw politics. They expect it — and in some cases demand it.\n\nIn the end, there’s little evidence that the No. 2 spot on the ballot sways many votes. But the pick can send important signals to the electorate about the presidential nominee’s judgment, values and decision-making process.\n\nHarris has plenty of credible options. What she doesn’t have is the luxury to sacrifice winning for anything else — for example, one more Democratic Senate seat, or a weekly lunch companion that she likes.\n\nDemocrats are understandably ecstatic about having a new champion with big energy who could diversify the ranks of the American presidency. They will soon realize again that Trump is a tough foe, that the economy is unchanged by the switcheroo on the ballot, and that they can’t afford to focus on anything but winning.\n\nMore on Harris' record:\n\nMore on Harris’ coalition:\n\nThat’s all from the Politics Desk for now. If you have feedback — likes or dislikes — email us at politicsnewsletter@nbcuni.com\n\nAnd if you’re a fan, please share with everyone and anyone. They can sign up here.",
    "tags": [],
    "nltk_summary": "In today’s edition, national political reporter Ben Kamisar breaks down our latest NBC News Deciders Focus Group series with Nikki Haley's primary voters.\nAnd yet, a new focus group of a key set of potential swing voters — supporters of Nikki Haley in the 2024 GOP primaries — illustrates just how hardened views of the election are.\nRead more from our focus group →Shapiro gets a dual boost in the veepstakesPennsylvania Gov.\nThe Philadelphia Democratic Party, for instance, explicitly endorsed a Harris-Shapiro ticket.\nIn the Trump era, voters in both parties have become far more comfortable with, and accustomed to, raw politics.",
    "nltk_keywords": [
      "politics",
      "vote",
      "group",
      "party",
      "democratic",
      "shapiro",
      "harris",
      "view",
      "nikki",
      "voters",
      "desk",
      "matchup",
      "focus",
      "harristrump",
      "haley",
      "trump"
    ]
  },
  {
    "title": "Great power politics: BRI and IMEEC at the crossroads of global influence",
    "description": "While BRI and IMEEC share identical objectives of enhancing connectivity and promoting economic growth, IMEEC may have a higher likelihood of success, provided that the US and its partners ensure the availability of financial resources",
    "partial_text": "While BRI and IMEEC share identical objectives of enhancing connectivity and promoting economic growth, IMEEC may have a higher likelihood of success, provided that the US and its partners ensure the availability of financial resources read more\nThe ... [5900 chars]",
    "url": "https://www.firstpost.com/opinion/great-power-politics-bri-and-imeec-at-the-crossroads-of-global-influence-13797030.html",
    "published_at": "2024-07-25T13:55:48+00:00",
    "media_source_name": "Firstpost",
    "media_source_url": "www.firstpost.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "While BRI and IMEEC share identical objectives of enhancing connectivity and promoting economic growth, IMEEC may have a higher likelihood of success, provided that the US and its partners ensure the availability of financial resources read more\n\nThe Belt and Road Initiative (BRI), China’s decade-old global initiative for interconnectedness, finds itself in competition with the United States’ proposed new economic corridor in partnership with India, Saudi Arabia, the UAE, and several European nations. At this critical juncture, one may question whether this is simply a matter of routine or if we are witnessing the convergence of great power politics into a new, ambitious geo-economic scheme. China’s anti-West stance has spawned numerous new threats to the world, leading to the formation of new alliances and acronyms for security strategies.\n\nAdvertisement\n\nThe rise of China and its ambition to lead the transition in the global political and economic structure turned out to be the major disruptors. China’s efforts to dismantle the established global order have shifted international relations towards a more complex dynamic of coexistence and peace, a concept the Chinese refer to as “peaceful coexistence and common prosperity”. As the world leans towards a bipolar power structure, these two initiatives — BRI and the India, Middle East, Europe Economic Corridor (IMEEC) — serve as a compelling case study for understanding the power transition theory and the growing scepticism of the United States towards China.\n\nChina’s economic rise has subtly orchestrated its political ambitions to end the current “disorder” and establish a “structured” world order, with the US remaining the sole pole. Russia is the dispositioned power (pole). To challenge the US, China has been vying for leadership in free trade and market dominance. China’s answer to the US-led Western “disorder” explicitly demonstrated the ongoing power transition in international relations. Well before China succeeds in ensuring the “orderly and free flow of economic factors”, the first step to challenge the US-led Western hegemony, as echoed by Xi Jinping in 2013 while launching BRI, entered into cycles of counter-offensives and strategic re-orientations. These shifts in the global power dynamic are causing significant conflicts and changes in international relations.\n\nChina emerged as the world’s second-largest economy after the global financial crisis in 2008, with its GDP estimated at well over $17 trillion, according to the World Bank. Fragile global growth and buoyant trade dynamics offered China an excuse to re-orient the international order. On the one hand, China decisively started regulating terms and conditions of trade and commerce externally and simultaneously used the accumulated wealth to bolster its defence capabilities.\n\nRecent estimates from SIPRI suggest that China spends over $250 billion on defence. China has also established parallel financial institutions, like the Asian Infrastructure Investment Bank, formed new alliance groups like the Shanghai Cooperation Organisation (SCO) and BRICS recently expanded, and played a role in brokering agreements between countries like Saudi Arabia and Iran.\n\nAdvertisement\n\nChina’s BRI, designed to connect Central Asia, West Asia, and other parts of the world, represented one of the most significant challenges to the US hegemony. The Chinese built corollaries, narratives, and stories of transformation and inclusiveness around the BRI projects without realising that they were as dominant, intolerant, and exclusive as the US-led Western exclusions. Since Donald Trump’s presidency, the US’ scepticism about China’s rise and increasing global power has become increasingly evident. Hence, the protectionism, trade safeguards that leads to trade wars, labelling Covid-19 as the “Chinese virus”, the Indo-Pacific Economic Framework for Prosperity (IPEF), and the formation of new groups like the Quad and AUKUS reflect the United States’ concerns about China’s expanding influence.\n\nAdvertisement\n\nThe proponents of the power transition theory are likely to view the recent economic corridor, IMEEC, as a counter to China’s BRI. Since the disintegration of the Soviet Union, the US has enjoyed the status of a single hegemon, and, as history suggests, it is unlikely to relinquish its claim without employing various methods to maintain the status quo. IMEEC represents the current hegemon’s strategy to protect its spheres of influence and prevent the rising power, China, from further expansion. IMEEC brings together some of the United States’ traditional allies, such as Saudi Arabia, and newer partners, like India, who declined to participate in BRI due to sovereignty concerns.\n\nAdvertisement\n\nThe fact that IMEEC starts in China’s neighbouring region underscores the current power politics in the international system. The US is employing strategies similar to China’s to maintain its superpower status. While BRI and IMEEC share identical objectives of enhancing connectivity and promoting economic growth, IMEEC may have a higher likelihood of success, provided that the US and its partners ensure the availability of financial resources. This is due to the United States’ democratic nature, relatively transparent financial sector, and the trust it still enjoys from most countries worldwide. In contrast, BRI has faced allegations of debt-trap diplomacy, undisclosed interest rates, and a trust deficit, even among its neighbouring nations.\n\nAdvertisement\n\nIndia has been vocal about the non-inclusive nature of world order of every sort. India disagrees with the Western and Chinese alternatives to world order because both feed into their construct of ‘power realms’. Over time, India’s inclusive world order has become more pluralistic globally; on the contrary, China’s and the US’ strategies reflect the Thucydides trap.\n\nAqib Rehman is research student at the Centre for East Asian studies, SIS, JNU, and student of Human Rights and Diplomacy at the University of Stirling. Neeraj Singh Manhas is Special Advisor for South Asia at the Parley Policy Initiative, Republic of Korea.",
    "tags": [
      "Xi Jinping",
      "China"
    ],
    "nltk_summary": "These shifts in the global power dynamic are causing significant conflicts and changes in international relations.\nSince Donald Trump’s presidency, the US’ scepticism about China’s rise and increasing global power has become increasingly evident.\nAdvertisementThe proponents of the power transition theory are likely to view the recent economic corridor, IMEEC, as a counter to China’s BRI.\nIMEEC represents the current hegemon’s strategy to protect its spheres of influence and prevent the rising power, China, from further expansion.\nIndia disagrees with the Western and Chinese alternatives to world order because both feed into their construct of ‘power realms’.",
    "nltk_keywords": [
      "politics",
      "imeec",
      "power",
      "crossroads",
      "world",
      "china",
      "great",
      "order",
      "chinas",
      "united",
      "economic",
      "bri",
      "global",
      "influence"
    ]
  },
  {
    "title": "Democrats praise Biden after president explains historic decision to step aside - US politics live",
    "description": "Kamala Harris, Nancy Pelosi and Gavin Newsom among those thanking Biden for his service",
    "partial_text": "5m ago 07.30 EDT Republican attacks on Harris to get ‘as ugly and bigoted as they can’ David Smith For Barack Obama there was “birtherism” and a name they said sounded like a specific Middle East terrorist. For Hillary Clinton there was “Lock her up”... [7614 chars]",
    "url": "https://www.theguardian.com/us-news/live/2024/jul/25/us-election-updates-harris-biden-trump",
    "published_at": "2024-07-25T11:30:05+00:00",
    "media_source_name": "The Guardian",
    "media_source_url": "www.theguardian.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "00.44 CEST 'I will not be silent' on Gaza, Harris says after meeting Netanyahu\n\nKamala Harris said she pressed Benjamin Netanyahu about her concerns about the humanitarian situation in Gaza in “frank” talks in Washington that are being closely watched for indications of how she might deal with Israel if she becomes president.\n\nAfter speaking to the Israeli prime minister she said:\n\nIsrael has a right to defend itself. And how it does so matters ... I made clear my serious concern about the dire humanitarian situation there [in Gaza] .... I will not be silent.\n\nHarris’s remarks, which were sharp and serious in tone, reflected what could be a shift from President Joe Biden in how she deals with Netanyahu, Reuters reported.\n\nHours earlier, Biden pressed for a ceasefire to the nine-month-old war in Gaza in his first face-to-face talks with Netanyahu since the president traveled to Israel days after Hamas’s 7 October attack on Israel and pledged American support.\n\nWhite House national security spokesperson John Kirby said gaps remained between Israel and the Hamas militants who run the Palestinian enclave in the drive for a ceasefire but “we are closer now than we’ve been before”.\n\n“Both sides have to make compromises,” Kirby said.",
    "tags": [],
    "nltk_summary": "After speaking to the Israeli prime minister she said:Israel has a right to defend itself.\nI made clear my serious concern about the dire humanitarian situation there [in Gaza] ....\nHarris’s remarks, which were sharp and serious in tone, reflected what could be a shift from President Joe Biden in how she deals with Netanyahu, Reuters reported.\nHours earlier, Biden pressed for a ceasefire to the nine-month-old war in Gaza in his first face-to-face talks with Netanyahu since the president traveled to Israel days after Hamas’s 7 October attack on Israel and pledged American support.\n“Both sides have to make compromises,” Kirby said.",
    "nltk_keywords": [
      "claim",
      "netanyahu",
      "president",
      "overturned",
      "israel",
      "humanitarian",
      "conviction",
      "kirby",
      "trump",
      "dispute",
      "talks",
      "pressed",
      "gaza",
      "criminal",
      "serious",
      "situation",
      "manhattan",
      "prosecutors",
      "happened"
    ]
  },
  {
    "title": "Murder suspect Christian Irick gets second bond in Richland arson",
    "description": "Christian Irick, out on bond for double murder, is now charged in a Richland County arson case. Bond is set at $250,000. The next court appearance is on Sept. 27.",
    "partial_text": "Richland County deputies say Irick is one of two suspects connected to an arson case on July 14 on Country Haven Road in Hopkins.\nExample video title will go here for this video\nExample video title will go here for this video\nCOLUMBIA, S.C. — A man c... [1931 chars]",
    "url": "https://www.wltx.com/article/news/local/suspected-arsonist-bond/101-4f7da1fb-d5ba-4947-b45d-80f9c37bb89b",
    "published_at": "2024-07-27T01:25:20+00:00",
    "media_source_name": "WLTX.com",
    "media_source_url": "www.wltx.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Richland County deputies say Irick is one of two suspects connected to an arson case on July 14 on Country Haven Road in Hopkins.\n\nExample video title will go here for this video\n\nExample video title will go here for this video\n\nCOLUMBIA, S.C. — A man charged with criminal conspiracy in connection with an arson case in Richland County earlier this month appeared in court Friday afternoon. A judge set a $250,000 bond for 22-year-old Christian Irick.\n\nIrick stood in court wearing an ankle monitor. He was already out on bond for a double murder from 2023 before his current charge. He was granted bond just three months ago in April for the murder charges. His bond at that time was set at $125,000, and he was ordered to wear an ankle monitor, maintain gainful employment, and remain on good behavior.\n\nRichland County deputies said Irick is one of two suspects connected to an arson case on July 14 on Country Haven Road in Hopkins.\n\nInvestigators said one of the suspects dumped gasoline underneath a home and started the fire while the victim was inside. The suspects left the scene before the deputies arrived. Deputies said the house is undergoing repairs from the fire damage.\n\nIrick was arrested Thursday morning at a family member's home in Florence County. Investigators located evidence related to the arson case. They also found two guns reported stolen out of Richland and Orangeburg counties. Investigators said they also discovered a large amount of narcotics in the home. According to the Richland County Sheriff's Department, these charges must be brought by Florence County.\n\nThe other suspect in this case, 18-year-old Travis Tucker, was arrested and charged with second-degree arson and possession of stolen guns. He is being held at Alvin S. Glenn Detention Center.\n\nNews19 has contacted the solicitor's office and is working to determine how Irick was able to receive a bond after violating a previous bond set for a double murder. We have not yet received a response.\n\nIf posted, Irick's bond would require he be under house arrest, wear a GPS ankle monitor, have no contact with the victims and remain 1,000 yards from their home, work, school or place of worship.",
    "tags": [],
    "nltk_summary": "Richland County deputies say Irick is one of two suspects connected to an arson case on July 14 on Country Haven Road in Hopkins.\nRichland County deputies said Irick is one of two suspects connected to an arson case on July 14 on Country Haven Road in Hopkins.\nInvestigators located evidence related to the arson case.\nAccording to the Richland County Sheriff's Department, these charges must be brought by Florence County.\nNews19 has contacted the solicitor's office and is working to determine how Irick was able to receive a bond after violating a previous bond set for a double murder.",
    "nltk_keywords": [
      "charges",
      "double",
      "receives",
      "case",
      "deputies",
      "suspect",
      "arson",
      "faces",
      "related",
      "set",
      "suspects",
      "murder",
      "richland",
      "monitor",
      "bond",
      "county"
    ]
  },
  {
    "title": "Man charged with murder in death of Hamilton father of three",
    "description": "A man has been charged with murder in connection with the shooting death of a 37-year-old man in Hamilton last month.",
    "partial_text": "A man has been charged with murder in connection with the shooting death of a 37-year-old man in Hamilton last month.\nOn Friday, Hamilton police provided an update on their investigation into the murder of Randy Peardon, confirming that the father of... [897 chars]",
    "url": "https://www.cp24.com/news/man-charged-with-murder-in-shooting-death-of-father-of-three-in-hamilton-1.6979129",
    "published_at": "2024-07-26T19:05:22+00:00",
    "media_source_name": "CP24 Toronto",
    "media_source_url": "www.cp24.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "A man has been charged with murder in connection with the shooting death of a 37-year-old man in Hamilton last month.\n\nOn Friday, Hamilton police provided an update on their investigation into the murder of Randy Peardon, confirming that the father of three died from multiple gunshot wounds.\n\nPeardon was found dead inside a three-storey apartment building on Connaught Avenue near Gage Avenue on the afternoon of June 15. An autopsy later determined that his death was a homicide.\n\n“While we have a clear understanding of the circumstances surrounding the murder, investigators continue to examine the events that followed,” police said in a news release on Friday.\n\nThey previously said that Peardon, who lived in the area but was not a resident at the address where he was found, was a “very innocent victim.”\n\nInvestigators announced that they arrested a suspect, 23-year-old Alexander La and charged him with second-degree murder.\n\nHe was already in custody on other charges when police apprehended him.\n\nHomicide investigators continue to ask anyone with information to contact them at 905-546-3825 or Crime Stoppers anonymously at 1-800-222-8477.",
    "tags": [],
    "nltk_summary": "A man has been charged with murder in connection with the shooting death of a 37-year-old man in Hamilton last month.\nOn Friday, Hamilton police provided an update on their investigation into the murder of Randy Peardon, confirming that the father of three died from multiple gunshot wounds.\nPeardon was found dead inside a three-storey apartment building on Connaught Avenue near Gage Avenue on the afternoon of June 15.\n“While we have a clear understanding of the circumstances surrounding the murder, investigators continue to examine the events that followed,” police said in a news release on Friday.\nHomicide investigators continue to ask anyone with information to contact them at 905-546-3825 or Crime Stoppers anonymously at 1-800-222-8477.",
    "nltk_keywords": [
      "avenue",
      "shooting",
      "investigators",
      "charged",
      "death",
      "father",
      "woundspeardon",
      "murder",
      "man",
      "hamilton",
      "continue",
      "peardon"
    ]
  },
  {
    "title": "Guernsey County Sheriff’s Office closes 34-year-old murder case; started over a pool game",
    "description": "60-year-old Carl Hoopingarner of Guernsey County goes to prison for life, and confesses to an additional murder in Colorado.",
    "partial_text": "CAMBRIDGE − Guernsey County Prosecutor Lindsey Angler was careful to say nothing can fix a family that has suffered the loss of a loved one at the hands of a murderer.\n“Nothing is going to repair the broken hearts of these family members,” she said w... [10409 chars]",
    "url": "https://news.yahoo.com/news/guernsey-county-sheriff-office-closes-091653762.html",
    "published_at": "2024-07-26T09:16:53+00:00",
    "media_source_name": "Yahoo News",
    "media_source_url": "news.yahoo.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "CAMBRIDGE − Guernsey County Prosecutor Lindsey Angler was careful to say nothing can fix a family that has suffered the loss of a loved one at the hands of a murderer.\n\n“Nothing is going to repair the broken hearts of these family members,” she said when discussing the 1990 murder of Guernsey County resident James Bradley. “But if we can get them closure and some understanding of what happened, then it’s a good day.”\n\nSgt. Bill Patterson, Detective Ryan Patterson (back) and Lt. Sam Williams discuss the 1990 cold case murder of James Bradley.\n\nBradley was murdered 34 years ago outside a bar that, at the time, was called the Raven. His murderer, Carl “Butch” Hoopingarner, 60, confessed to the crime earlier this year after being detained by the Guernsey County Sheriff’s Office for a suspected homicide in Colorado. He pled guilty to the aggravated murder charge for Bradley’s death in court June 14.\n\nHoopingarner was sentenced June 27 by the Guernsey County Court of Common Pleas Judge Daniel G. Padden to life in prison with the possibility for parole after serving 20 years. The Guernsey County resident was also sentenced to a consecutive 5-to-7.5-year prison term for aggravated trafficking in drugs, a second-degree felony, stemming from a Belmont County case.\n\n“The earliest he’ll be eligible for parole is 2049,” said Angler. He must also register as a violent offender. No restitution was ordered in this case, according to court records.\n\nAngler said the sheriff’s office stayed on this case until they could get their suspect into custody.\n\n“I’m extremely proud of our law enforcement agencies. They never give up on these investigations,” said Angler of cold cases. “We’re lucky to be in a community with law enforcement officers that care so deeply about the right people being held accountable.”\n\nJust because a case is out of sight does not mean it ever goes out of mind for law enforcement, she said.\n\n“The cases that are not solved stick with them,” she said. “You never know when today is the day you get the information you need to get a result like this. They don’t give up.”\n\nSgt. Bill Patterson with the Guernsey County Sheriff's Office works on the James Bradley 1990 murder case which was recently closed after a confession by Carl \"Butch\" Hoopingarner.\n\nThe 34-year hunt for a killer\n\nBack in 1990, Bradley was found dead in his car after it had been lit on fire, according to Sgt. Bill Patterson of the sheriff’s office, who along with his team, Det. Ryan Patterson, and Lt. Sam Williams, was responsible for bringing Hoopingarner in.\n\nHow he died and what happened is a bit murky. To start with, there was very little physical evidence.\n\n“No autopsy was conducted,” said Patterson. When asked if exhuming the body was a possibility to glean physical evidence that could better explain what happened to Bradley, Patterson was quick to point out: “He was cremated.”\n\nPatterson said he doesn’t know why an autopsy wasn’t conducted in 1990, but that “the requirements of documentation were not the same as they are now.”\n\nAt the time of Bradley’s death, the sheriff’s office wasn’t convinced it was simply accidental that the victim’s car caught on fire, so it remained open as a cold case given they had no physical evidence or eyewitness statements to provide any leads on the case.\n\nThirty-one years later, they got the call that every detective working a cold case is desperate for — somebody knew something.\n\n“In 2021, we got a phone call that a prisoner in Monroe County jail had information on our cold case,” said Patterson. “I went down and conducted an interview in Monroe County jail and this guy says he knows (Hoopingarner) and that (Hoopingarner) admitted that he was involved in the death of James Bradley.”\n\nPatterson said the informant gave them a substantial statement with details only the murderer would have known. At the time, Hoopingarner was in an Ohio prison with eight months left on his sentence.\n\n“We just waited it out,” said Patterson. “He wasn’t going to talk with us willingly.”\n\nAt the same time, Patterson started working a drug case on Hoopingarner in conjunction with Belmont County, of which Hoopingarner is now serving the 5 to 7 .5 years.\n\n“We were trying to get enough evidence to get him into jail so we could talk to him,” said Sgt. Patterson. “We filed charges and put a warrant out for his arrest (following his release from prison). When it came time to arrest him, we executed the search warrant to take him into custody, and he’s gone.”\n\nFast forward to February 2024, and the sheriff’s office is contacted by the Colorado Bureau of Investigation — they’ve got warrants out for Hoopingarner’s arrest. He’s accused of murdering a Guernsey County resident in Colorado and they believe Hoopingarner fled in the victim’s car, back to Guernsey County.\n\n“So, we started to track him by cell phone and other means, but no luck,” said Sgt. Patterson, adding that Hoopingarner later admitted to destroying his cell phone so he couldn’t be traced. He also later admitted that he knew he had warrants out for his arrest in Guernsey County, which is why he fled to Colorado. “So, we started checking addresses where he was known to live in Ohio.”\n\nHe said at that point, Det. Patterson checked on one of the addresses in Buffalo. He drove by the house on Feb. 20 and saw the Colorado victim’s car sitting outside, said Sgt. Patterson.\n\n“We surround the house and meet with the homeowner who confirms Hoopingarner is inside,” said Sgt. Patterson. “Hoopingarner walks out and surrenders to law enforcement.”\n\nHolding Hoopingarner responsible 34 years later\n\nWhen the sheriff’s office took Hoopingarner into custody in February, Hoopingarner gave them an absolutely “far-fetched, fabricated story that couldn’t have been true if he wanted it to be,” about the Colorado homicide he’s suspected of, said Sgt. Patterson.\n\n“When we say ‘This can’t be true,’ he confesses to the homicide in Colorado,” said Sgt. Patterson, who added the Colorado case is still under investigation. Hoopingarner would be extradited to Colorado only if he is paroled in 2049. “But he denies his involvement in the murder of Bradley, so we stopped the interview and told him to let us know if he wanted to talk.”\n\nThe next morning, Hoopingarner asked both Sgt. Patterson and Det. Patterson to come back.\n\n“He apologized to us and said, ‘I lied to you,’” said Sgt. Patterson. “He then gives us pretty much verbatim the same statement that (the informant gave us) back in 2021.”\n\nHe said none of those details had been public record or reported in the news.\n\n“There was no way these two people would have had that same information.”\n\nDuring Hoopingarner’s confession, a third witness was implicated. When the sheriff’s office tracked that person down, they got a third statement that supported the first two.\n\nSo, what really happened Aug. 19 and Aug. 20 of 1990?\n\nAccording to Sgt. Patterson, what they believed happened on Aug. 19 and Aug. 20 that led to the death of Bradley all started over a pool game.\n\n“Hoopingarner says they’re at a different bar in Cambridge before they all end up at the Raven,” said Sgt. Patterson. “At the previous bar, they have a fight over a pool game and Hoopingarner and another person leave that bar.”\n\nSgt. Patterson said it’s not clear if they went back roading or to someone’s house but at some point, they end up at the Raven. And when they walked in, lo and behold, the same people they fought with at the previous bar were at the Raven. One of them was Bradley.\n\n“The bartender tells Hoopingarner to leave because he’s intoxicated, so he leaves and drives to his mother’s house,” said Sgt. Patterson.\n\nHe said two witnesses corroborated that Hoopingarner siphoned gasoline out of a motorbike. Sgt. Patterson said when the witnesses asked Hoopingarner what he’s doing he told them to “Leave me alone and don’t worry about it.”\n\nHoopingarner went back to the Raven and waited for Bradley to leave, according to Sgt. Patterson. Then, while Bradley is in his car, he and Hoopingarner got into a fight.\n\nIt’s at this point Sgt. Patterson must draw his own conclusions, as it’s unclear from witness statements, he said, or even from Hoopingarner’s confession, exactly what happened next. An autopsy could have solved the issue, but that was, again, never conducted.\n\n“Some things indicate a knife was involved,” said Sgt. Patterson. “Witnesses mention seeing stabbing motions.”\n\nSgt. Patterson said Hoopingarner only admitted to “dumping gasoline on Bradley and the car, and some admissions to how the fire was started.”\n\n“(Hoopingarner) tried to implicate someone else in starting the fire,” said Sgt. Patterson. “And he tried to say Bradley was intoxicated (and that’s why he didn’t try to escape the fire).”\n\nBut according to Sgt. Patterson, witnesses said Bradley made no noise and had no reaction to the fire, leading him to believe that Bradley could have already been dead or near death, at the time the fire was started.\n\nWhen asked about holding those witnesses accountable who stood by and did nothing, Sgt. Patterson said many of the charges that would have applied in 1990 are no longer available for prosecution.\n\n“We’re well past the statute of limitations for many of the charges (for bystanders and witnesses),” he said. “We’re still investigating all avenues. If we can hold anyone else responsible, we will.”\n\nCold cases are never truly cold\n\nOne of the hardest parts about law enforcement is there isn’t always a finished product, said Sgt. Patterson, who has been working cases for 15 years.\n\n“It’s not like construction, where you get to build a house and stand back and look at the final product,” he said of working cases that often don’t see closure, or they see less than favorable closures when a sentence or charge is less than what they want. “When you get to close a cold case — in this case, waiting 34 years for justice — I don’t know that there’s a more satisfying feeling than to sit down with a family member and say we have enough to bring closure, to bring justice for their lost family member.”\n\nSgt. Patterson said of the Hoopingarner case that the hurry up and wait course of the case was difficult.\n\n“For me, I have very impatient tendencies, so to sit back and wait can be frustrating,” he said. “But I knew we were heading down the right path. Working a case in its entirety and having the patience required for a long-term investigation is necessary.\n\n“The most important thing is that the families can have closure,” said Sgt. Patterson. “Justice, in this case, was served.”\n\nThis article originally appeared on The Daily Jeffersonian: Guernsey County Sheriff’s Office closes 34-year-old murder case",
    "tags": [
      "FA corner",
      "Stock market",
      "Super Bowl",
      "Options pit",
      "ETF report",
      "Crypto",
      "Economics",
      "Earnings",
      "Personal finance"
    ],
    "nltk_summary": "The Guernsey County resident was also sentenced to a consecutive 5-to-7.5-year prison term for aggravated trafficking in drugs, a second-degree felony, stemming from a Belmont County case.\nAngler said the sheriff’s office stayed on this case until they could get their suspect into custody.\nBill Patterson with the Guernsey County Sheriff's Office works on the James Bradley 1990 murder case which was recently closed after a confession by Carl \"Butch\" Hoopingarner.\nHe’s accused of murdering a Guernsey County resident in Colorado and they believe Hoopingarner fled in the victim’s car, back to Guernsey County.\n“Justice, in this case, was served.”This article originally appeared on The Daily Jeffersonian: Guernsey County Sheriff’s Office closes 34-year-old murder case",
    "nltk_keywords": [
      "hoopingarner",
      "bradley",
      "started",
      "case",
      "pool",
      "guernsey",
      "colorado",
      "sgt",
      "county",
      "murder",
      "office",
      "game",
      "closes",
      "sheriffs",
      "patterson"
    ]
  },
  {
    "title": "3 face murder charges in Mississippi for Southern student who disappeared before custody hearing",
    "description": "WOODVILLE, Miss. — A trio—including an ex-girlfriend—who allegedly plotted to kill a former Southern University sophomore found shot dead, now face murder charges in western Mississippi, the Wilkinson County Sheriff said Friday.",
    "partial_text": "3 face murder charges in Mississippi for Southern student who disappeared before custody hearing\nWOODVILLE, Miss. — A trio—including an ex-girlfriend—who allegedly plotted to kill a former Southern University sophomore found shot dead, now face murde... [2354 chars]",
    "url": "https://www.wbrz.com/news/3-face-murder-charges-in-mississippi-for-southern-student-who-disappeared-before-custody-hearing",
    "published_at": "2024-07-26T04:00:00+00:00",
    "media_source_name": "WBRZ",
    "media_source_url": "www.wbrz.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "3 face murder charges in Mississippi for Southern student who disappeared before custody hearing\n\nWOODVILLE, Miss. — A trio—including an ex-girlfriend—who allegedly plotted to kill a former Southern University sophomore found shot dead, now face murder charges in western Mississippi, the Wilkinson County Sheriff said Friday.\n\nDerek Terrell Hollins Jr., 21, Calajia Jack, 20, and Allyah Martin, 21, each face first-degree murder charges in Wilkinson County, where a body believed to be Steven Harris was found shot.\n\nThe three suspects were arrested on conspiracy to commit first-degree murder in West Feliciana Parish on Thursday, where they are currently being held as they await extradition proceedings to face their murder charges in Mississippi, Wilkinson County deputies said.\n\nThe body found on Tuesday has not been positively identified as Harris, but investigators said they are confident in their assessment that the body is Harris after discussions with his family.\n\nThe Wilkinson County Coroner's Office has not yet conducted an autopsy, saying that they are waiting on a DNA sample from Harris' family.\n\nIn Louisiana, 20th District Attorney Sam D'Aquilla said there is no plan to call for a grand jury in this case, as he plans to charge all three individuals involved.\n\nEarlier in the week, West Feliciana Parish Sheriff Brian Spillman said that his office found evidence that the trio of suspects conspired to lure Harris to Mississippi and kill him.\n\n\"We believe the plan to commit this crime was hatched here, and the initial phases leading up to Steven’s death began here in West Feliciana Parish,\" Spillman said.\n\nOne of the suspects, Martin, was dating Harris and had a child with him. The pair had a history of filing restraining orders against one another, each alleging physical abuse on the other's behalf, court records show.\n\nThe pair ultimately settled on joint custody with their son mostly living with Martin and having visitation with Harris. He later filed a complaint asking that she be held in contempt because she had moved to Texas without notifying him, violating their custody agreement which required notification of any move of more than 50 miles.\n\nAccording to Harris' family, he went missing a little over a week before a Thursday custody hearing where he was eager to keep fighting for the full custody of his son. Harris' son is currently living with Harris' parents, they told WBRZ.\n\nHarris' mother Lasonia already had suspicions of Martin when Allyah told her that her son was at the same location where his cell phone last pinged. Only Lasonia, her husband and the police knew of the last location, adding that her son and Martin weren't on speaking terms when he disappeared.\n\nDespite Southern University saying that there are no university or student-planned memorials for Harris, the Southern University Marching Band—The Human Jukebox—extended their condolences to his family.\n\n\"Steven was not just a bandmate; he was part of our family, and his memory will always hold a special place in our hearts,\" a post from Thursday said.",
    "tags": [],
    "nltk_summary": "3 face murder charges in Mississippi for Southern student who disappeared before custody hearingWOODVILLE, Miss.\n— A trio—including an ex-girlfriend—who allegedly plotted to kill a former Southern University sophomore found shot dead, now face murder charges in western Mississippi, the Wilkinson County Sheriff said Friday.\nThe three suspects were arrested on conspiracy to commit first-degree murder in West Feliciana Parish on Thursday, where they are currently being held as they await extradition proceedings to face their murder charges in Mississippi, Wilkinson County deputies said.\nHarris' son is currently living with Harris' parents, they told WBRZ.\nDespite Southern University saying that there are no university or student-planned memorials for Harris, the Southern University Marching Band—The Human Jukebox—extended their condolences to his family.",
    "nltk_keywords": [
      "charges",
      "hearing",
      "custody",
      "face",
      "martin",
      "murder",
      "wilkinson",
      "university",
      "son",
      "harris",
      "southern",
      "disappeared",
      "student",
      "mississippi"
    ]
  },
  {
    "title": "Gonzales man accused of killing wife has history of domestic abuse, murder allegations dating back to 1990s",
    "description": "GONZALES — A Gonzales man arrested in the shooting death of his wife has been arrested twice before in killings -- including a triple murder with two child victims -- but was not convicted in those cases, court records show.",
    "partial_text": "Gonzales man accused of killing wife has history of domestic abuse, murder allegations dating back to 1990s\nGONZALES — A Gonzales man arrested in the shooting death of his wife has been arrested twice before in killings -- including a triple murder w... [1500 chars]",
    "url": "https://www.wbrz.com/news/gonzales-man-accused-of-killing-wife-has-history-of-domestic-abuse-murder-allegations-dating-back-to-1990s",
    "published_at": "2024-07-26T04:00:00+00:00",
    "media_source_name": "WBRZ",
    "media_source_url": "www.wbrz.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Gonzales man accused of killing wife has history of domestic abuse, murder allegations dating back to 1990s\n\nGONZALES — A Gonzales man arrested in the shooting death of his wife has been arrested twice before in killings -- including a triple murder with two child victims -- but was not convicted in those cases, court records show.\n\nHe was acquitted in one case and had the triple murder charges dropped by prosecutors.\n\nSean Morris, 50, was arrested Wednesday for second-degree murder after a shooting on Garcon Road in Gonzales left his wife, 44-year-old Brenda Morris, dead, Ascension Parish deputies said.\n\nIn 1993, he was arrested in Livingston Parish for the shooting death of a neighbor. They had been feuding over money. Morris was acquitted at trial, records show.\n\nHe was also indicted in the May 2000 murder of a woman, her 4-year-old daughter and a 7-year-old. Morris and Marvin Jones allegedly kidnapped the three victims, took them to a remote road in Port Allen, shot them all in the head and left them to die. Jones was convicted of the crime, but charges against Morris were dropped in 2014, records say.\n\nMorris was booked with domestic abuse battery in 2023, but records show that the case was dismissed later that year. It is unclear from court records whether his wife was the victim, but she was subpoenaed in the case.\n\nMorris was also arrested in 2009 for holding up a sushi restaurant and pleaded guilty to simple burglary in 2015; by 2018, he was issued a first-offender pardon.\n\nHe also pleaded guilty to simple property damage in December 2023 and was sentenced to 30 days in jail, but the imposition of his sentence was delayed until Feb. 7, 2024, and he didn’t show up for court, records show. A bench warrant was then issued.",
    "tags": [],
    "nltk_summary": "Gonzales man accused of killing wife has history of domestic abuse, murder allegations dating back to 1990sGONZALES — A Gonzales man arrested in the shooting death of his wife has been arrested twice before in killings -- including a triple murder with two child victims -- but was not convicted in those cases, court records show.\nHe was acquitted in one case and had the triple murder charges dropped by prosecutors.\nSean Morris, 50, was arrested Wednesday for second-degree murder after a shooting on Garcon Road in Gonzales left his wife, 44-year-old Brenda Morris, dead, Ascension Parish deputies said.\nMorris was booked with domestic abuse battery in 2023, but records show that the case was dismissed later that year.\nIt is unclear from court records whether his wife was the victim, but she was subpoenaed in the case.",
    "nltk_keywords": [
      "records",
      "wife",
      "shooting",
      "victims",
      "court",
      "killing",
      "accused",
      "arrested",
      "murder",
      "man",
      "allegations",
      "domestic",
      "triple",
      "dating",
      "history",
      "gonzales",
      "morris"
    ]
  },
  {
    "title": "Missouri judges have overturned 2 murder convictions in recent weeks. Why did the AG fight freedom?",
    "description": "A man who was on the verge of walking out of prison this week after a judge found evidence of his “actual innocence” and overturned his murder conviction now faces a fresh legal hurdle.",
    "partial_text": "ST. LOUIS (AP) — A man who was on the verge of walking out of prison this week after a judge found evidence of “actual innocence” and overturned his murder conviction now faces a fresh legal hurdle.\nThe person blocking Christopher Dunn’s freedom is M... [6377 chars]",
    "url": "https://apnews.com/article/christopher-dunn-missouri-conviction-overturned-bc213e05442642428638fe5c1bf95b99",
    "published_at": "2024-07-26T02:22:27+00:00",
    "media_source_name": "The Associated Press",
    "media_source_url": "apnews.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "ST. LOUIS (AP) — A man who was on the verge of walking out of prison this week after a judge found evidence of “actual innocence” and overturned his murder conviction now faces a fresh legal hurdle.\n\nThe person blocking Christopher Dunn’s freedom is Missouri Attorney General Andrew Bailey, who is fresh off an unsuccessful battle to keep another woman whose murder conviction was reversed imprisoned.\n\nPolitical scientists say Bailey’s efforts are a way to appear tough on crime and shore up votes in advance of a tough primary race. Judges and defense attorneys are voicing frustration.\n\n“His actions are causing undue harm to this innocent individual and is a stain on our legal system,” Michael Heiskell, president of the National Association of Criminal Defense Lawyers, said when asked about Bailey’s opposition to Dunn’s release.\n\nHere are some things to know:\n\nWho is Christopher Dunn?\n\nDunn, who is Black, was 18 in 1990 when 15-year-old Ricco Rogers was killed. Among the key evidence used to convict him of first-degree murder was testimony from two boys who were at the scene of the shooting. Both later recanted their testimony, saying they had been coerced by police and prosecutors.\n\nJudge Jason Sengheiser on Monday overturned the murder conviction of the now 52-year-old and ordered his immediate release. Bailey’s office appealed, and prison officials declined to release Dunn.\n\nSengheiser then held an emergency hearing Wednesday and threatened to hold the warden in contempt if he didn’t free Dunn within hours. Dunn was signing papers, preparing to walk out the door, when the Missouri Supreme Court agreed to consider Bailey’s objections and halted his release, a corrections department spokesperson said.\n\n“That is not justice,” the Midwest Innocence Project, which is representing Dunn, said in a statement.\n\nA spokesperson for Bailey defended the attorney general in an email Thursday night.\n\n“Throughout the appeals process, multiple courts have affirmed Christopher Dunn’s murder conviction,” the statement said. “We will always fight for the rule of law and to obtain justice for victims.”\n\nDunn’s case marks the second “actual innocence” ruling in the state in recent weeks. Sandra Hemme, now 64, spent 43 years in prison for the fatal 1980 stabbing of a library worker before a judge overturned her conviction.\n\nAppeals by Bailey — all the way up to the Missouri Supreme Court — kept Hemme imprisoned at the Chillicothe Correctional Center for more than a month after that initial ruling. During a court hearing last Friday, Judge Ryan Horsman scolded an attorney in Bailey’s office for telling the warden not to release Hemme on her own recognizance pending an appellate court review.\n\n“To call someone and tell them to disregard a court order is wrong,” Horsman said. He said that if Hemme wasn’t released within hours, Bailey himself would have to appear in court with contempt of court on the table.\n\nHemme, whose attorneys with the Innocence Project described her as the longest held wrongly incarcerated woman known in the U.S., was released later that day.\n\n“The court has to be obeyed,” said Michael Wolff, a former Missouri Supreme Court judge and chief justice.\n\nBailey’s opposition to innocence claims\n\nA Missouri law adopted in 2021 lets prosecutors request hearings when they see evidence of a wrongful conviction.\n\nThe law was passed after another judge, William Hickle, found in 2020 that a jury would likely find Dunn not guilty based on new evidence. But Hickle declined to order Dunn’s release, citing a 2016 Missouri Supreme Court ruling that only people on death row could make a “freestanding” claim of actual innocence.\n\nIn 2023, Bailey opposed the release of Lamar Johnson, who spent 28 years in prison for murder. Another St. Louis judge overturned Johnson’s conviction, and he was freed.\n\nStakes are even higher for a hearing next month. St. Louis County’s prosecutor believes DNA evidence shows that Marcellus Williams didn’t commit the crime that landed him on death row. DNA of someone else — but not Williams — was found on the knife used in the 1998 killing, experts said.\n\nA hearing on Williams’ innocence claim begins Aug. 21. His execution is scheduled for Sept. 24.\n\nBailey’s office is opposing the challenge to Williams’ conviction, too.\n\nBailey’s appointment as attorney general\n\nWhen Eric Schmitt was elected to the U.S. Senate in November 2022, Republican Gov. Mike Parson appointed Bailey, who at the time was serving as the governor’s lawyer, as Schmitt’s replacement.\n\nBailey’s first election test comes in next month’s primary. Ken Warren, a professor emeritus of political science at Saint Louis University, said fighting the release of people in custody advances Bailey’s agenda.\n\n“This will only help him with his base,” he said.\n\nBailey’s opponent, Will Scharf, a former federal prosecutor who recently served as an attorney for former President Donald Trump, has been attacking Bailey as liberal, said Steven Puro, professor emeritus of political science of St. Louis University.\n\nPuro said Bailey is balancing the need to look tough while avoiding being perceived as uncaring and not obeying the law.\n\n“Most other prosecutors have thought the risk was not worth the reward,” Puro said.\n\nBailey’s use of the courts\n\nSince taking office, Bailey has sued Planned Parenthood and President Joe Biden, tried to force clinics that provide gender-affirming care to hand over their records, and pushed a liberal prosecutor to resign.\n\nWhen debate over transgender minors’ access to gender-affirming health care reached a fever pitch in Missouri in 2023, Bailey tried to restrict access to both minors and adults by regulation — a move typically reserved for the state’s health department.\n\nHe later pulled the rule amid legal battles and action from the Legislature. Most recently, Bailey sued the state of New York over its prosecution of Trump, arguing that Trump’s conviction constitutes election interference.\n\nRichard Serafini, a former federal prosecutor now in private practice, called the lawsuit against New York “one of the silliest things that I think I’ve ever heard of in the practice of law.”\n\nAnd Lindsay Runnels, an attorney who serves on the board of the Midwest Innocence Project, questioned the fight to free people once judges have ruled.\n\n“The system doesn’t work if our highest law enforcement officer in the state flouts the court system and believes that they are not accountable to them for their orders and following orders,” she said. “It’s insane.”\n\n___\n\nSummer Ballentine contributed to this report from Columbia, Missouri. Hollingsworth reported form Mission, Kansas.",
    "tags": [],
    "nltk_summary": "The person blocking Christopher Dunn’s freedom is Missouri Attorney General Andrew Bailey, who is fresh off an unsuccessful battle to keep another woman whose murder conviction was reversed imprisoned.\nJudge Jason Sengheiser on Monday overturned the murder conviction of the now 52-year-old and ordered his immediate release.\n“Throughout the appeals process, multiple courts have affirmed Christopher Dunn’s murder conviction,” the statement said.\n“The court has to be obeyed,” said Michael Wolff, a former Missouri Supreme Court judge and chief justice.\nBailey’s opposition to innocence claimsA Missouri law adopted in 2021 lets prosecutors request hearings when they see evidence of a wrongful conviction.",
    "nltk_keywords": [
      "innocence",
      "attorney",
      "convictions",
      "bailey",
      "weeks",
      "release",
      "judges",
      "recent",
      "freedom",
      "ag",
      "murder",
      "conviction",
      "fight",
      "judge",
      "baileys",
      "court",
      "overturned",
      "missouri"
    ]
  },
  {
    "title": "Gang jailed for life for ammonia attack which killed ‘gentle, funny, caring’ man",
    "description": "The murder of Andy Foster in his home in Gateshead was one of a series of ammonia attacks designed to enforce a gang’s drugs trade, a judge said.",
    "partial_text": "* FIRST NAME\n* LAST NAME\n* EMAIL Your email address\n* PASSWORD Must be at least 6 characters, include an upper and lower case character and a number Show\n* YEAR OF BIRTH You must be at least 18 years old to create an account 2006 2005 2004 2003 2002 ... [927 chars]",
    "url": "https://www.standard.co.uk/news/crime/dove-gateshead-newcastle-crown-court-northumbria-police-b1173133.html",
    "published_at": "2024-07-26T12:27:14+00:00",
    "media_source_name": "Evening Standard",
    "media_source_url": "www.standard.co.uk",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "* FIRST NAME\n\n* LAST NAME\n\n* EMAIL Your email address\n\n* PASSWORD Must be at least 6 characters, include an upper and lower case character and a number Show\n\n* YEAR OF BIRTH You must be at least 18 years old to create an account 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982 1981 1980 1979 1978 1977 1976 1975 1974 1973 1972 1971 1970 1969 1968 1967 1966 1965 1964 1963 1962 1961 1960 1959 1958 1957 1956 1955 1954 1953 1952 1951 1950 1949 1948 1947 1946 1945 1944 1943 1942 1941 1940 1939 1938 1937 1936 1935 1934 1933 1932 1931 1930 1929 1928 1927 1926 1925 1924 1923 1922 1921 1920 1919 1918 1917 1916 1915 1914 1913 1912 1911 1910 1909 1908 1907 1906\n\n* Required fields\n\nI would like to be emailed about offers, events and updates from Evening Standard. Read our privacy notice\n\nCREATE ACCOUNT\n\nI'LL TRY LATER\n\nAlready have an account? SIGN IN\n\nBy clicking Create Account you confirm that your data has been entered correctly and you have read and agree to our Terms of use , Cookie policy and Privacy policy .\n\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
    "tags": [
      "Gateshead",
      "Newcastle Crown Court",
      "Dove",
      "Northumbria Police"
    ],
    "nltk_summary": "* FIRST NAME* LAST NAME* EMAIL Your email address* PASSWORD Must be at least 6 characters, include an upper and lower case character and a number Show* YEAR OF BIRTH You must be at least 18 years old to create an account 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982 1981 1980 1979 1978 1977 1976 1975 1974 1973 1972 1971 1970 1969 1968 1967 1966 1965 1964 1963 1962 1961 1960 1959 1958 1957 1956 1955 1954 1953 1952 1951 1950 1949 1948 1947 1946 1945 1944 1943 1942 1941 1940 1939 1938 1937 1936 1935 1934 1933 1932 1931 1930 1929 1928 1927 1926 1925 1924 1923 1922 1921 1920 1919 1918 1917 1916 1915 1914 1913 1912 1911 1910 1909 1908 1907 1906* Required fieldsI would like to be emailed about offers, events and updates from Evening Standard.\nRead our privacy noticeCREATE ACCOUNTI'LL TRY LATERAlready have an account?\nSIGN INBy clicking Create Account you confirm that your data has been entered correctly and you have read and agree to our Terms of use , Cookie policy and Privacy policy .\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
    "nltk_keywords": [
      "create",
      "attack",
      "terms",
      "updates",
      "chemical",
      "funny",
      "read",
      "policy",
      "gentle",
      "email",
      "caring",
      "killed",
      "account",
      "jailed",
      "privacy",
      "life",
      "man",
      "gang",
      "upper",
      "try"
    ]
  },
  {
    "title": "'Gritty' Roy Keane tipped for huge big screen move after stunning Dublin locals filming 'really funny' new promo",
    "description": "GRITTY Roy Keane would make a perfect big screen hitman after wowing on set yesterday, a top director has revealed.The Manchester United icon brought",
    "partial_text": "GRITTY Roy Keane would make a perfect big screen hitman after wowing on set yesterday, a top director has revealed.\nThe Manchester United icon brought the seaside town of Skerries, Co Dublin, to a standstill as he filmed a Sky ad — with experts now c... [4231 chars]",
    "url": "https://www.thesun.ie/sport/13480062/roy-keane-skerries-dublin-ad-fans-movie-united-sky/",
    "published_at": "2024-07-26T06:00:00+00:00",
    "media_source_name": "The Irish Sun",
    "media_source_url": "www.thesun.ie",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "GRITTY Roy Keane would make a perfect big screen hitman after wowing on set yesterday, a top director has revealed.\n\nThe Manchester United icon brought the seaside town of Skerries, Co Dublin, to a standstill as he filmed a Sky ad — with experts now calling for him to become a movie sensation.\n\n8 A top Irish director has said Roy Keane would be the 'perfect' big-screen hitman Credit: Garrett White - Commissioned by The Sun Dublin\n\n8 The footie icon was seen shooting an ad in Skerries on Thursday Credit: Garrett White - Commissioned by The Sun Dublin\n\n8 Keane stopped to chat with fans and take pictures while filming\n\n8 Locals said Keano was 'lovely' and 'couldn't have been nicer' Credit: Garrett White - Commissioned by The Sun Dublin\n\nAcclaimed Irish director Robbie Walsh, best known for Irish movie The Letters, told The Irish Sun: “I don’t know why Roy Keane hasn’t gotten into the ­movies sooner.\n\n“Watching the clips of him ­acting on the streets of Skerries, I think he has amazing presence and a great look.\n\n\"Roy has this real cool, silent character about him — if I was looking for a gritty silent hitman, Roy would be perfect.”\n\nSkerries locals looked on in astonishment as the ­Cork man filmed scenes at four different locations in the north Dublin enclave.\n\nAnd although the former Ireland skipper is often accused of being cranky, Keano delighted the throngs of well-wishers in attendance, exchanging hurling banter with a thrilled youngster.\n\nRoy was also happy to pose for a snap with The Irish Sun. But the 52-year-old was saying nothing about the filming and new Ireland boss Heimir Hallgrímsson.\n\nA local insider revealed how the filming had started the previous day inside a new luxury home in Red Island, overlooking the Skerries harbour.\n\nThe source told The Irish Sun: “It’s a really funny scene which starts with Roy in his house trying to watch the match. But there’s a window cleaner bothering him.\n\n“So Roy sets off to watch the match on his mobile, visiting various outside locations around Skerries including The Rock bakery.”\n\nHis natural ease in front of a camera often has ­producers drooling, with the Sky Sports pundit a natural heir to football hardman Vinnie Jones.\n\nRoy Keane comes out with 'most relatable thing he's ever said' as Man Utd legend tells story about going to barbers\n\nInsiders have also stressed how impressed they’ve been with Keane’s on-screen abilities and social media impressions since he joined Sky Sports as a pundit.\n\nA source who worked with Keane on a recent project told The Irish Sun: “He was a joy to work with. He arrived early and stayed beyond filming just to make sure everyone had what they needed. Roy couldn’t have been more helpful.”\n\nStarting at 10am yesterday, Roy filmed inside a local shop before breaking in upmarket Potager restaurant, which is famous for its fine cuisine — although it wasn’t their prawn sandwiches he was after.\n\nPotager’s Sarah Ryan told The Irish Sun: “Roy came in to visit us but he wasn’t ­dining with us. They needed a quiet spot out of the way in between filming.\n\n\"Roy was absolutely lovely to deal with. We were thrilled to have him visit.”\n\nResuming the shoot on nearby Church Street, Roy was joined by a hound resembling his beloved Trigger, made famous following Keane’s Saipan walkout in 2002.\n\nThroughout the day Roy was happy to pose for selfies with locals and even make quick videos for loved ones.\n\nAs word got around the soccer star was nearby, Skerries turned into a town of Reds.\n\nRoy's box office By BARRY MORAN, Content Editor ROY Keane divides opinion wherever he goes, but most people would agree on the caricature of a cranky Corkman. However, the ex-Ireland footie captain proved the doubters wrong once again during a fun-filled visit to Skerries yesterday. The dad-of-five couldn’t have been more accommodating as he spoke with fans while filming a new ad for employers Sky Sports. Though he was happy to pose for a pic with The Irish Sun, the midfield great was in no mood to discuss Ireland’s new managerial appointment. But the TV star impressed everyone with his affable nature and his easygoing ways with the countless fans who approached him. Now, top directors are calling for Roy to be cast in blockbuster films, such is his appeal with the general public. People in Ireland could have told you many years ago that Roy is box office in any situation, knowing our own fascination with the man. Anything Keane does is big news, whether it’s his musings on being asked for selfies to whatever he says on air. So it’s only natural that Hollywood bigwigs would take note of his star charisma and look to cast him in big roles. Irish director Robbie Walsh can’t understand why Keano hasn’t made the switch yet and reckons the PL all-timer would make a perfect enforcer. He has already been the basis for critically-acclaimed plays so why not movies.\n\nFather and daughter Aidan and Leah Kivlehan, who live locally, were among those who met the player-turned-manager.\n\nLeah, 11, told The Irish Sun: “We only heard this morning that Roy was in Skerries. So I wanted to go and meet him. Roy was super nice.\n\n\"I really liked him. He signed my football as well. I love United.”\n\nOne local told us: “Roy couldn’t have been nicer and it was a very easy going shoot. The film people were lovely.”\n\nIt’s not Roy’s first foray into adverts.\n\nHe famously starred in a Walkers ad with Gary Lineker, and a hilarious “prawn sandwich”-inspired ­Barclaycard ad with Niall Quinn and Angus Deaton after his infamous interview raging against corporate football fans.\n\nMost recently he did an ­Adidas promo with his dog.\n\n8 Father and daughter Aidan and Leah Kivlehan were among those who met Roy yesterday\n\n8 Roy with Showbiz Editor Ken Sweeney\n\n8 Acclaimed Irish director Robbie Walsh",
    "tags": [
      "selfies",
      "Sky",
      "social media",
      "Sky Sports",
      "man utd news"
    ],
    "nltk_summary": "GRITTY Roy Keane would make a perfect big screen hitman after wowing on set yesterday, a top director has revealed.\nRoy's box office By BARRY MORAN, Content Editor ROY Keane divides opinion wherever he goes, but most people would agree on the caricature of a cranky Corkman.\nIrish director Robbie Walsh can’t understand why Keano hasn’t made the switch yet and reckons the PL all-timer would make a perfect enforcer.\nI love United.”One local told us: “Roy couldn’t have been nicer and it was a very easy going shoot.\n8 Father and daughter Aidan and Leah Kivlehan were among those who met Roy yesterday8 Roy with Showbiz Editor Ken Sweeney8 Acclaimed Irish director Robbie Walsh",
    "nltk_keywords": [
      "keane",
      "couldnt",
      "promo",
      "gritty",
      "director",
      "filming",
      "tipped",
      "screen",
      "roy",
      "huge",
      "ad",
      "really",
      "stunning",
      "told",
      "locals",
      "irish",
      "skerries",
      "sky"
    ]
  },
  {
    "title": "Ice Spice: Y2K! review - wilfully trashy wordplay from wily new rap star",
    "description": "The US star’s subject matter is lightweight and this debut album only lasts 23 minutes, but funny, snotty lines abound and the music is often viscerally exciting",
    "partial_text": "Ice Spice is a divisive figure in the world of rap. There are people who think her rise over the last two years is representative of all that’s wrong with rap: witness the wailing and gnashing of teeth that greeted her inclusion in Complex’s list of ... [5279 chars]",
    "url": "https://www.theguardian.com/music/article/2024/jul/26/ice-spice-y2k-album-review-10k-projects-capitol",
    "published_at": "2024-07-26T04:00:40+00:00",
    "media_source_name": "The Guardian",
    "media_source_url": "www.theguardian.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Ice Spice is a divisive figure in the world of rap. There are people who think her rise over the last two years is representative of all that’s wrong with rap: witness the wailing and gnashing of teeth that greeted her inclusion in Complex’s list of the 50 best New York rappers, albeit at No 50. Equally, there are people who posit her as something of a saviour figure, “a new rap star in a genre that sorely needs one”, as one recent US profile put it, citing statistics that point to “a steady decline in [rap]’s consumption”. Said figures suggested rap and R&B’s share of the US market had declined by 1.5% between 2022 and 2023, but it was still by far the biggest genre in America – no need to man the lifeboats just yet. But you can’t argue with the fact that Ice Spice (born Isis Gaston) is rap’s biggest breakout star in recent memory: feted by Taylor Swift and responsible for four US platinum singles in just over six months.\n\nView image in fullscreen The artwork for Y2K! Photograph: AP\n\nThe weird thing is that the naysayers and boosters alike have reached their conclusions for exactly the same reasons. There is Ice Spice’s relentless pop focus. “Let’s talk drill / Who bigger than she?” she brags on her debut album’s Gimmie a Light, but her take on the subgenre rids it of grit and menace. Admittedly her current single, a collaboration with Central Cee called Did It First, features plenty of gunfire in time with the hard Jersey club beat, but the filtered vocal samples behind it are melancholy, even poignant. The synth line on the amazingly titled Think U the Shit (Fart) carries with it a memory of electro-infused 80s pop-R&B. When the backing tracks tend to the ominous – as on Phatt Butt or Plenty Sun – something about Ice Spice’s snotty humour lends their mood the air of a cartoon or video game.\n\nThen there are the lyrics. You could decry them as disjointed and insubstantial, but that seems to be the point. “I wouldn’t consider myself a lyricist,” she has said, explaining that she never writes anything: she freestyles over the beat, then stitches together the most striking, “super simple” lines. Accordingly, her success isn’t founded on the deftness of her thought-provoking turn of phrase or the depth of what she has to say, but on her ability to create snappy lines that go viral: “She a baddie with her baddie friend”; “You thought I was feeling you?”. The word “Munch” is both the title of her breakthrough single and a swiftly adopted slang term for a largely useless man. Sometimes her lyrics cut out the middleman and simply adopt existing memes: Think U the Shit (Fart) comes from a years-old viral image of Super Mario smoking a joint with the caption: “Bitches be thinking they the shit, but they ain’t even the fart.”\n\nIce Spice and Central Cee: Did It First – video\n\nIt’s rap that clearly fits the moment, built for a world in which everything is mediated online, and Ice Spice’s debut album displays the strengths and drawbacks of her approach. If insubstantiality is the accusation, well, Y2K! is 23 minutes long and four of its tracks have previously been released as singles: its release brings with it a whole 15 minutes of new music. That said, it makes a virtue of its brevity. The tracks last just long enough to lodge in your brain, then end. Producer RiotUSA ensures everything comes packing a hook, and moreover he’s capable of generating viscerally exciting soundscapes, as on Bitch I’m Packin’, which alternately teems with grimy electronics and lapses into eerie sparseness.\n\nskip past newsletter promotion Sign up to Sleeve Notes Free weekly newsletter Get music news, bold reviews and unexpected extras. Every genre, every era, every week Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nAnd the album as a whole doesn’t hang around long enough to bore you, a distinct possibility given Ice Spice’s limitations as a rapper who sticks doggedly to one flow, one style of delivery. If you want rap to provide insight or unflinching street-level reportage, you’ve clearly come to the wrong place: you’re unlikely to find it on an album where everything from beefs to infidelities to the measuring of one’s celebrity is conducted online; on which no one ever seems to go outside, unless they’re traversing the distance between a front door and a people carrier. But funny, snotty, quotable lines abound: “Bitches stay on my Pauly D / Send ’em back home like the cab’s here”; “I’m Miss Poopie like I need a diaper”.\n\nWilfully trashy, brief and throwaway, Y2K! is unlikely to enter the pantheon of great rap albums. Ice Spice has enjoyed a rapid rise by chiming with the times, so you do wonder what’s going to happen to its author when times change. But the album succeeds on its own terms: it’s fun while it lasts. Whether that also proves to be a summation of Ice Spice’s career is a question left hanging.\n\nThis week Alexis listened to\n\nKing Hannah – New York, Let’s Do Nothing\n\nI belatedly discovered King Hannah’s album via a friend’s best-of-2024-so-far playlist. New York, Let’s Do Nothing is fantastic: a witty, sharp, Courtney Barnett-esque paean to idling in Manhattan.",
    "tags": [],
    "nltk_summary": "Ice Spice is a divisive figure in the world of rap.\nBut you can’t argue with the fact that Ice Spice (born Isis Gaston) is rap’s biggest breakout star in recent memory: feted by Taylor Swift and responsible for four US platinum singles in just over six months.\nThere is Ice Spice’s relentless pop focus.\nIce Spice has enjoyed a rapid rise by chiming with the times, so you do wonder what’s going to happen to its author when times change.\nWhether that also proves to be a summation of Ice Spice’s career is a question left hanging.",
    "nltk_keywords": [
      "wordplay",
      "review",
      "wily",
      "spices",
      "tracks",
      "rap",
      "y2k",
      "spice",
      "star",
      "wilfully",
      "online",
      "think",
      "york",
      "album",
      "ice",
      "trashy"
    ]
  },
  {
    "title": "Kirby Smart Takes a Witty Swipe at Retired Nick Saban With a Funny Mention of His Wife Ms. Terry",
    "description": "Georgia Bulldogs head coach Kirby Smart makes fun of the legendary Nick Saban’s “old school” dance moves taught by his wife, Terry Saban",
    "partial_text": "Georgia Bulldogs’ victories are often celebrated with head coach Kirby Smart’s cha-cha moves. The host of the\nOn3 Recruits\nADVERTISEMENT Article continues below this ad\npodcast\nADVERTISEMENT Article continues below this ad\nPolls of the day Polls 1 of... [1141 chars]",
    "url": "https://www.essentiallysports.com/nfl-ncaa-news-kirby-smart-takes-a-witty-swipe-at-retired-nick-saban-with-a-funny-mention-of-his-wife-ms-terry/",
    "published_at": "2024-07-26T03:12:13+00:00",
    "media_source_name": "Essentially Sports",
    "media_source_url": "www.essentiallysports.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Georgia Bulldogs’ victories are often celebrated with head coach Kirby Smart’s cha-cha moves, which recently prompted the host of the On3 Recruits podcast to switch a discussion to a quirky topic. And what better debate away from the numbers than Smart’s victory groove? While discussing his signature moves, Smart landed a witty take on the legend, Nick Saban, and his wife, Terry.\n\nThe Georgia HC tagged Saban “old school“ in contrast to his funky dance routine. The credit for the decency that the ex-Alabama Crimson Tide HC maintains while dancing goes to none other than his wife, Terry Saban. While it was a tease, Smart proved he holds Saban in his personal “Hall of Respect Fame” at the SEC Media Days.\n\nSmart reveals Terry being Saban’s dance mentor\n\nADVERTISEMENT Article continues below this ad\n\nThe now Bulldogs HC spent nine seasons under Saban, ranging from LSU, Miami Dolphins, and Alabama Crimson Tide. Over the years, Smart has picked up the best of the best secrets from the legend’s coaching playbook he applies to this day for his program. But mind you, Smart won’t be following Saban’s lead on the dance floor. On the podcast, the Bulldogs HC pointed out, “Our dance styles are completely different though. He’s old school. He’s like the guy that hits the backboard and basketball and uses the glass. I’m not a bank player. I’m trying to strip the net and go same thing in dancing he’s old school.“\n\nPolls of the day Polls 1 of 4 Do you think Kirby Smart's comment about Nick Saban's wife was out of line? Absolutely Not at all It was just a joke Saban deserved it Will Carson Beck's performance make or break the Georgia Bulldogs' season? Yes No Too early to tell Depends on the rest of the team Who do you think has a better shot at the Heisman Trophy? Carson Beck Shedeur Sanders Travis Hunter Other Who do you think had the most impactful meeting with Jalen Milroe? Aaron Judge Manchester City's Croatian star Both equally Neither\n\nvia Imago Credits: Imago\n\nTill now, everyone used to turn to Saban for advice. Have you ever wondered who the ex-Crimson Tide HC turns to when he needs any advice? It’s none other than his better half for 52 years, Terry. Smart and Saban’s bond allowed the Georgia HC to pass a light-hearted jab: “He’s got a patented dance that he can do and he does a great job of that and I think Miss Terry probably taught him.” Even though Smart might have made fun of the legend, he keeps Saban on a pedestal.\n\nADVERTISEMENT Article continues below this ad\n\nSmart pays homage to Saban\n\nOn July 16, Smart visited the SEC Media Days 2024. The day before, the famous Nick Saban was stopped from entering because he did not have credentials. Supporting his mentor, Smart first commented, “I got in here without a credential today.”\n\nADVERTISEMENT Article continues below this ad\n\nHe then bounced on the opportunity to douse Saban with flattery. Smart walked on a path of gratitude and confessed, “A couple words I want to say to Coach Saban, who meant so much to me in my career. First of all, the words he shared at the ESPYs the other night were incredible. Very touching, very moving.” The now Georgia HC is one lucky man who found a mentor, a friend, a competitor, and all three in one person who encouraged him to be a better person.\n\nFor 11 years, Smart and Saban shared the same room, which ranged from a staff room to a defensive room or defensive back room. To date, the Bulldogs HC gives the GOAT all the credit for his success.",
    "tags": [],
    "nltk_summary": "While discussing his signature moves, Smart landed a witty take on the legend, Nick Saban, and his wife, Terry.\nThe Georgia HC tagged Saban “old school“ in contrast to his funky dance routine.\nThe credit for the decency that the ex-Alabama Crimson Tide HC maintains while dancing goes to none other than his wife, Terry Saban.\nFor 11 years, Smart and Saban shared the same room, which ranged from a staff room to a defensive room or defensive back room.\nTo date, the Bulldogs HC gives the GOAT all the credit for his success.",
    "nltk_keywords": [
      "hc",
      "dance",
      "wife",
      "ms",
      "witty",
      "nick",
      "terry",
      "smart",
      "room",
      "georgia",
      "sabans",
      "takes",
      "saban",
      "swipe",
      "bulldogs",
      "retired",
      "think"
    ]
  },
  {
    "title": "Serena Williams Shows Bright Smiles in Unexpectedly Candid Moment With Novak Djokovic at 2024 Paris Olympics",
    "description": "Serena Williams adds a funny charm to her conversation with Novak Djokovic at the prelude ceremony of Paris Olympics.",
    "partial_text": "The city of love is currently grooving with the vibe of the Olympics. To fuel people’s excitement for the event, the Louis Vuitton Foundation hosted a grand prelude ceremony that showed A-listers from Anna Wintour to Serena Williams on the red carpet... [3075 chars]",
    "url": "https://www.essentiallysports.com/wta-atp-tennis-olympics-news-serena-williams-shows-bright-smiles-in-unexpectedly-candid-moment-with-novak-djokovic-at-twenty-twenty-four-paris-olympics/",
    "published_at": "2024-07-26T02:21:29+00:00",
    "media_source_name": "Essentially Sports",
    "media_source_url": "www.essentiallysports.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "The city of love is currently grooving with the vibe of the Olympics. To fuel people’s excitement for the event, the Louis Vuitton Foundation hosted a grand prelude ceremony that showed A-listers from Anna Wintour to Serena Williams on the red carpet. Not only did Williams impress with her second attempt as a host but she also charged up Novak Djokovic. His enticing smile hints at his confidence.\n\nThe Olympics starts today. However, the celebrities are arriving in Paris for the prelude of the quadrennial event. From Zendaya to Mick Jagger, many popular Hollywood names appeared on the red carpet. Four-time Olympic gold medalist Serena Williams hosted the prelude ceremony with Charlize Theron, Omar Sy, and Rosalia. Dressed in a black Louis Vuitton pantsuit and a blue handbag, Williams rocked the night showing her glamorous aura to the audience.\n\nADVERTISEMENT Article continues below this ad\n\nWhat’s your reaction? Did Serena Williams and Novak Djokovic just give us the most iconic Olympic moment? React! Reactions\n\nThe prelude to the Olympics took place at the Foundation Louis Vuitton designed by Frank Gehry, bringing several athletes together. Both Djokovic and Williams were seen sharing a good conversation over a laugh with each other. In fact, a fan page shared an image on their X platform where Williams is spotted pointing towards Djokovic as director Spike Lee and the Serb were all smiles and laughter.\n\nDjokovic attended the event in a blue tuxedo and a white shirt. He highlighted his dashing look with a pair of white sneakers and a signature blue watch. The Serb’s beautiful wife Jelena Djokovic donned a white t-shirt dress with black sandals and a clutch of the same color.\n\nADVERTISEMENT Article continues below this ad\n\nWilliams and the Djokovic family oozed glamor at the prelude ceremony. Djokovic also has a prospect of meeting his biggest rival Rafael Nadal in the second round at Stade Roland-Garros for the first time since 2022. Referring to the Mallorcan legend’s prospect of retirement, Djokovic expressed his anxiousness over this exclusive sports event as he remembered the difficulties he had in the tournament in the past.\n\nNovak Djokovic admits that the Olympics “ have always been a great challenge” for him\n\nDjokovic expressed his excitement to get the opportunity to play against Nadal in the Olympics. He said, “It would be exciting to play against Nadal in the second round. I am aware that an era with Nadal and Murray’s retirements after the Games is ending, I feel more ready than I was before Wimbledon. I had many opportunities to win gold and now I have to start taking advantage of them. The fact that I am not a favorite for bookmakers is just a motivation for me. The Olympic Games have always been a great challenge for me.”\n\nADVERTISEMENT Article continues below this ad\n\nSpeaking about his hard work and resilience for the Olympics, Djokovic revealed how he believes he would adapt well on the surface given that he played the Roland Garros two months before, Djokovic’s statements bring a lot of assurance about his preparations for this exclusive sports event.\n\nWith Serena Williams’ charm added to the Olympics, this year the ceremony will be one-of-a-kind entertaining viewers with a mind-blowing display of athleticism and hard work. So, are you ready for the Olympics?",
    "tags": [
      "Serena Williams",
      "Novak Djokovic"
    ],
    "nltk_summary": "Not only did Williams impress with her second attempt as a host but she also charged up Novak Djokovic.\nFour-time Olympic gold medalist Serena Williams hosted the prelude ceremony with Charlize Theron, Omar Sy, and Rosalia.\nDid Serena Williams and Novak Djokovic just give us the most iconic Olympic moment?\nADVERTISEMENT Article continues below this adWilliams and the Djokovic family oozed glamor at the prelude ceremony.\nWith Serena Williams’ charm added to the Olympics, this year the ceremony will be one-of-a-kind entertaining viewers with a mind-blowing display of athleticism and hard work.",
    "nltk_keywords": [
      "white",
      "novak",
      "williams",
      "prelude",
      "djokovic",
      "unexpectedly",
      "nadal",
      "paris",
      "serena",
      "olympics",
      "moment",
      "ceremony",
      "vuitton",
      "shows",
      "event",
      "smiles"
    ]
  },
  {
    "title": "Deadpool & Wolverine’s Mid- & Post-Credits Scenes, Explained",
    "description": "The mid-credits scene after ‘Deadpool and Wolverine’ is surprisingly sentimental, while the post-credits hits a funny and foul-mouthed note.",
    "partial_text": "Photo: Jay Maidment/20th Century Studios/MARVEL\nWarning: Spoilers ahead for Deadpool & Wolverine.\nIt’s no surprise that Deadpool & Wolverine, Ryan Reynolds’ and Hugh Jackman’s official welcome to the Marvel Cinematic Universe, features bonus footage ... [4122 chars]",
    "url": "https://www.vulture.com/article/deadpool-and-wolverines-mid-and-post-credits-scenes-explained.html",
    "published_at": "2024-07-26T01:02:03+00:00",
    "media_source_name": "Vulture",
    "media_source_url": "www.vulture.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Photo: Jay Maidment/20th Century Studios/MARVEL\n\nWarning: Spoilers ahead for Deadpool & Wolverine.\n\nIt’s no surprise that Deadpool & Wolverine, Ryan Reynolds and Hugh Jackman’s official welcome to the Marvel Cinematic Universe, features bonus footage during and after the credits. One of these is a typical fourth-wall-breaking Deadpool gag. But the other, which arrives mid-credits, is an unconventionally sentimental farewell to the now-defunct era of non–Marvel Studios–produced Marvel movies. And you know what? It’s actually sort of moving, if a little mawkish.\n\nSeveral characters from pre-MCU Marvel movies make cameo appearances in the film, with a handful sticking around to find closure for their stories. Within the film’s fiction, this means we see characters like Jennifer Garner’s Elektra (introduced in the Ben Affleck–starring Daredevil), Wesley Snipes as the daywalking vampire Blade, and Channing Tatum as Gambit (a role he never actually got to play until now) fight until the end despite losing their respective worlds. In a meta-textual sense, it means tying a neat bow on some of the characters and franchises that existed before Disney’s MCU juggernaut took hold of popular culture.\n\nAs the closing credits roll, Green Day’s wistful punk ballad “Good Riddance (Time of Your Life)” accompanies clips and behind-the-scenes footage from non-MCU films new and old, paying tribute to these once-scattered properties produced by different studios as they prepare to enter the Marvel fold under a single umbrella. We see footage from the 20th Century Fox–produced Fantastic Four films; its Daredevil and Elektra movies; its X-Men trilogy, prequels, and various Wolverine spinoffs; as well as New Line’s Blade movies featuring Snipes.\n\nWhile this montage can be hard to take seriously at times — it’s unlikely anyone watching has much love for Jamie Bell’s stone-faced Thing in Fant4stic, including Bell — the reel rides the line between facetious and fond as it bids good-bye to other, more beloved mainstays of the superhero-movie boom. Everyone from the Magnetos and Xaviers of the X-Men films (Ian McKellan/Michael Fassbender and Patrick Stewart/James McAvoy, respectively) to Jackman’s Wolverine get their due. The B-roll sees them goofing off on set and taking bows as the cast and crew around them applaud.\n\nThe montage finally ends on an image of the 20th Century Fox opening logo (which also appears as a practical set in the film, in the apocalyptic “void” where people and objects from alternate realities are discarded forever). Since the studio was purchased by Disney, its logo has changed to read “20th Century Studios,” so this is likely the last time its original incarnation will appear onscreen in a new release. It’s a little strange to hold a corporation in as high regard as the individuals who made these films, but now that all other avenues of Marvel nostalgia have been exhausted — from resurrecting characters seen decades ago, to actors’ cameos in parts they almost played — treating studio logos with the same admiration feels like the next logical step.\n\nThe stinger at the very end of the credits scroll is more irreverent, and in that way more traditional. Deadpool (Reynolds) addresses the camera in the TVA’s control room and absolves himself of a macabre gag from earlier in the film, when he’d claimed to the powerful, telekinetic villainess Cassandra Nova (Emma Corrin) that Chris Evans’s Johnny Storm (his role from Fantastic Four) had gone on an inventively profane tirade against her. Johnny frantically denied doing anything of the sort, but Cassandra ripped the skin off his body over the perceived insult anyway. Yikes. In the moment, it seemed like Deadpool had merely been passing the buck as a distraction, but in the post-credits scene, he runs back unseen footage from the movie, in which Evans indeed utters every single insult Deadpool alleged he had, vindicating the merc with a mouth.\n\nJohnny’s rant is especially amusing to hear coming out from Evans, who spent most of his time in the MCU playing wholesome Boy Scout Captain America. You’d never hear Steve Rogers lament his “cum-gutter existence” and say he wouldn’t be satisfied even if he were to “urinate on [Cassandra’s] freshly barbecued corpse and husk-fuck the charred remains” while “gargling Juggernaut’s jugger-nuts.” As Cap would say, “Language!”",
    "tags": [
      "explainer",
      "marvel cinematic universe",
      "language!",
      "ryan reynolds",
      "post-credits scene",
      "Video",
      "TV Recaps",
      "deadpool & wolverine",
      "movies",
      "See All",
      "mid-credits scene",
      "hugh jackman"
    ],
    "nltk_summary": "Photo: Jay Maidment/20th Century Studios/MARVELWarning: Spoilers ahead for Deadpool & Wolverine.\nIt’s no surprise that Deadpool & Wolverine, Ryan Reynolds and Hugh Jackman’s official welcome to the Marvel Cinematic Universe, features bonus footage during and after the credits.\nBut the other, which arrives mid-credits, is an unconventionally sentimental farewell to the now-defunct era of non–Marvel Studios–produced Marvel movies.\nSeveral characters from pre-MCU Marvel movies make cameo appearances in the film, with a handful sticking around to find closure for their stories.\nThe stinger at the very end of the credits scroll is more irreverent, and in that way more traditional.",
    "nltk_keywords": [
      "mid",
      "footage",
      "wolverines",
      "film",
      "deadpool",
      "movies",
      "scenes",
      "postcredits",
      "marvel",
      "films",
      "credits",
      "explained",
      "wolverine",
      "characters",
      "century"
    ]
  },
  {
    "title": "A Kamala Harris meme imagines fake but funny campaign promises",
    "description": "What is Vice President Kamala Harris’ policy platform?",
    "partial_text": "What is Vice President Kamala Harris’ policy platform? The internet has some suggestions.\nA new meme has social media users floating whimsical, fake campaign promises from Harris that would satisfy the most niche desires of pop culture fans, from rel... [2727 chars]",
    "url": "https://www.nbcnews.com/tech/internet/kamala-harris-meme-imagines-fake-funny-campaign-promises-rcna163708",
    "published_at": "2024-07-25T21:29:41+00:00",
    "media_source_name": "NBC News",
    "media_source_url": "www.nbcnews.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "What is Vice President Kamala Harris’ policy platform? The internet has some suggestions.\n\nA new meme has social media users floating whimsical, fake campaign promises from Harris that would satisfy the most niche desires of pop culture fans, from releasing Beyoncé’s “Renaissance” film on streaming services to bringing back Miller Lite vortex beer bottles.\n\nThe memes show an official portrait of Harris side by side with an image referring to the fake campaign promise and are written in the style of an official campaign announcement. Some say Harris would enact the promise within the first 100 days of her presidency or start with a breaking news label.\n\n“Kamala Harris has announced that, if elected, she will sign into law a bill requiring Spice World to be available on Netflix,” said a tweet using the meme format, in reference to the U.K. girl group Spice Girls’ feature film.\n\nSince Harris’ campaign for the Democratic presidential nominee officially began Sunday after President Joe Biden announced that he would not run for re-election and endorsed Harris, instead, her popularity has surged online alongside memes created by young and progressive voters.\n\nAn anecdote Harris shared with the line “You think you just fell out of the coconut tree?” echoed around the internet this week, while viral videos remixed clips of Harris with songs from the Charli XCX album “Brat.”\n\nSome stan communities, which refers to passionate fandoms, have thrown their support behind Harris already. A “Swifties For Kamala” page on X, launched Sunday, racked up more than 40,000 followers in four days.\n\nHarris is also re-introducing herself to voters on the campaign trail, which in part means she needs to lay out her policies for the country if she wins the White House.\n\nThe first popular post to use the “If elected” format was also a reference to Swift. Posted to X on Tuesday and viewed over 1 million times, the post says Harris would extend Swift’s Eras Tour in the U.S. and add the songs “the last great american dynasty” and “tolerate it” back onto Swift’s set list.\n\nOne of the most-liked posts using the format says Harris “will ensure that your PS5 won’t beep loudly and show you that weird scary screen that says you turned it off the wrong way even though you totally didn’t.”\n\nHarris’ official campaign has also leaned into the memes and pop culture references that have dominated online discussion of her candidacy. The official “Kamala HQ” X account for her campaign updates echoes the “Brat” album cover, and it posted a viral TikTok video with the Chappell Roan song “Femininomenon” alongside pictures of Harris and former President Donald Trump.\n\nThe “Kamala HQ” accounts on X and TikTok skyrocketed in followers and engagement after they were rebranded from “Biden HQ” after the president suspended his re-election campaign. The campaign has yet to refer to the “If elected” format, and a representative for Harris did not immediately respond to a request for comment.",
    "tags": [],
    "nltk_summary": "What is Vice President Kamala Harris’ policy platform?\nThe memes show an official portrait of Harris side by side with an image referring to the fake campaign promise and are written in the style of an official campaign announcement.\nThe first popular post to use the “If elected” format was also a reference to Swift.\nThe “Kamala HQ” accounts on X and TikTok skyrocketed in followers and engagement after they were rebranded from “Biden HQ” after the president suspended his re-election campaign.\nThe campaign has yet to refer to the “If elected” format, and a representative for Harris did not immediately respond to a request for comment.",
    "nltk_keywords": [
      "x",
      "official",
      "hq",
      "funny",
      "kamala",
      "fake",
      "memes",
      "promises",
      "president",
      "imagines",
      "harris",
      "elected",
      "campaign",
      "format",
      "meme"
    ]
  },
  {
    "title": "Blake Lively reacts to Taylor Swift’s cheeky comment about Ryan Reynolds",
    "description": "Blake Lively is matching Taylor Swift’s energy. The 36-year-old actress had a hilarious response to Swift’s recent Instagram Story where the pop star, 34, shared a sweet and funny...",
    "partial_text": "Taylor Swift also revealed that she’s godmother to Blake Lively and Ryan Reynolds’ kids\nBlake Lively is matching Taylor Swift’s energy.\nThe 36-year-old actress had a hilarious response to Swift’s recent Instagram Story where the pop star, 34, shared ... [962 chars]",
    "url": "https://www.thenews.com.pk/latest/1213544-blake-lively-reacts-to-taylor-swifts-cheeky-comment-about-ryan-reynolds",
    "published_at": "2024-07-25T19:00:00+00:00",
    "media_source_name": "The News International",
    "media_source_url": "www.thenews.com.pk",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "Taylor Swift also revealed that she’s godmother to Blake Lively and Ryan Reynolds’ kids\n\nBlake Lively is matching Taylor Swift’s energy.\n\nThe 36-year-old actress had a hilarious response to Swift’s recent Instagram Story where the pop star, 34, shared a sweet and funny tribute to Lively’s husband Reynolds, 47, and his work on the new film, Deadpool & Wolverine.\n\n“I couldn’t have said it better myself,” Lively wrote, reposting Swift’s original Story. “Which is unsurprising given that I have 14 fewer Grammys and not a single sold-out stadium world tour.”\n\nIn Swift’s post, she praised Reynolds for pouring his heart and soul into the Marvel film. “He’s created the best work of his life, and the film feels like an actual joy portal, a wild escape from reality and an abs sandwich. I don’t know how he did it,” she wrote.\n\nSwift then jokingly redirected the tribute to Reynolds’ costar Hugh Jackman, 55, quipping, “But that’s just Hugh.”\n\nIn the same post, Swift joked about Reynolds, referring to him as “Wade Wilson, aka my godkids’ sperm donor!” This playful nod referenced both Reynolds’ Deadpool character and his role as the father of Lively’s four children: James, 9, Inez, 7, Betty, 4, and Olin, 17 months.",
    "tags": [],
    "nltk_summary": "Taylor Swift also revealed that she’s godmother to Blake Lively and Ryan Reynolds’ kidsBlake Lively is matching Taylor Swift’s energy.\nThe 36-year-old actress had a hilarious response to Swift’s recent Instagram Story where the pop star, 34, shared a sweet and funny tribute to Lively’s husband Reynolds, 47, and his work on the new film, Deadpool & Wolverine.\n“I couldn’t have said it better myself,” Lively wrote, reposting Swift’s original Story.\n“Which is unsurprising given that I have 14 fewer Grammys and not a single sold-out stadium world tour.”In Swift’s post, she praised Reynolds for pouring his heart and soul into the Marvel film.\n“He’s created the best work of his life, and the film feels like an actual joy portal, a wild escape from reality and an abs sandwich.",
    "nltk_keywords": [
      "reacts",
      "comment",
      "livelys",
      "swifts",
      "work",
      "lively",
      "film",
      "taylor",
      "cheeky",
      "tribute",
      "swift",
      "reynolds",
      "ryan",
      "post",
      "blake"
    ]
  },
  {
    "title": "Chinese Shopkeeper Shows AMD Ryzen 9000 \"Zen 5\" Desktop CPU Prices, Lower Than Ryzen 7000 Series",
    "description": "A Chinese shopekeeper based in Bejing has a really weird yet funny way of showing off AMD Ryzen 9000 \"Zen 5\" Desktop CPU prices.",
    "partial_text": "A Chinese shopkeeper based in Bejing has a really weird yet funny way of showing off AMD Ryzen 9000 \"Zen 5\" Desktop CPU prices which appear to be lower than the Ryzen 7000 MSRP's for China.\nAMD Ryzen 9000 \"Zen 5\" Desktop CPUs Prices For China Appear ... [3522 chars]",
    "url": "https://wccftech.com/chinese-shopkeeper-amd-ryzen-9000-zen-5-desktop-cpu-prices-lower-ryzen-7000-series/",
    "published_at": "2024-07-25T15:00:18+00:00",
    "media_source_name": "Wccftech",
    "media_source_url": "wccftech.com",
    "listing_query": "funny",
    "listing_source": "gnews",
    "full_text": "A Chinese shopkeeper based in Bejing has a really weird yet funny way of showing off AMD Ryzen 9000 \"Zen 5\" Desktop CPU prices which appear to be lower than the Ryzen 7000 MSRP's for China.\n\nAMD Ryzen 9000 \"Zen 5\" Desktop CPUs Prices For China Appear To Be Much Lower Than Ryzen 7000 MSRPs\n\n80IT, a computer hardware store based in Bejing China, and affiliated with Taobao, has put up what seems to be their expected prices for China. The shop owner also showed off Ryzen 9000 Desktop CPU boxes which suggests that they might be the ones to receive the early batch of Zen 5 chips but we know now that they have been recalled due to quality assurance issues. (The live stream is still going on and do check it out if you want a chuckle).\n\nImage Source: 80IT\n\nSo what makes this price exposure weird is that the shopkeeper has casually put up a board that shows the initial prices in USD and Chinese RMB currencies. Previously, the same shopkeeper also showed off boxes of the chip behind the board which listed estimated prices but they have since put up what they believe are \"initial\" prices for the Ryzen 9000 \"Zen 5\" Desktop CPUs.\n\nImage Source: 80IT\n\nAccording to the retailer, the AMD Ryzen 9 9950X 16-Core CPU would cost $499 US (3631 RMB), the Ryzen 9 9900X 12-Core CPU would cost $399 US (2904 RMB), the Ryzen 7 9700X 8-Core would cost $299 US (2176 RMB) while the Ryzen 5 9600X 6-Core CPU would cost $229 US (1666 RMB). Previous \"estimated\" listing had the prices at 5099 RMB, 3799 RMB, 3099 RMB, and 2399 RMB for respective Ryzen 9000 \"Zen 5\" CPUs.\n\nFollowing are the official launch MSRPs of AMD's existing Ryzen 7000 \"Zen 4\" Desktop CPUs that can be used for comparison:\n\nRyzen 9 7950X - 5499 RMB\n\n5499 RMB Ryzen 9 7900X - 4299 RMB\n\n4299 RMB Ryzen 7 7700X - 2999 RMB\n\n2999 RMB Ryzen 5 7600X - 2249 RMB\n\nNow it is entirely possible that the shopkeeper may have seen the recent pricing rumors and based the pricing off of those but it's still interesting nonetheless since it's coming from a shopkeeper that has the AMD Ryzen 9000 \"Zen 5\" Desktop CPUs with them.\n\nIn addition to the prices, the shopkeeper also shares some of his personal performance metrics & compares the Ryzen 9 9950X, Ryzen 7 9700X & Ryzen 5 9600X against Intel's 14th Gen offerings. He states that the Ryzen 9 9950X offers lower power consumption, lower temperatures, and higher multi-threading performance versus the 14900K with an average 20% performance increase in a wide variety of applications. Without PBO, the gaming performance is said to be 15% ahead of the 14900K.\n\nOriginal Non-Translated Image:\n\nTranslated Image:\n\nImage Source: 80IT\n\nFor the AMD Ryzen 7 9700X, the CPU offers an average 70W power consumption in gaming and runs at around 60-65C using a standard 6-heatpipe air cooler. With PBO, the Ryzen 7 9700X can beat the Ryzen 7 7800X3D and its single-core performance is also higher versus the Intel Core i7-14700K. Lastly, the Ryzen 5 9600X is said to lead over the Core i5-14600K by 10-20% in games and can even outperform the Ryzen 9 9950X in certain titles.\n\nThe AMD Ryzen 9000 \"Zen 5\" Desktop CPUs will now be launching in August. The Ryzen 7 9700X & Ryzen 5 9600X will be hitting retail shelves on the 8th of August while the Ryzen 9 9950X & the Ryzen 9 9900X will be hitting retail shelves on the 15th of August. Expect a proper pricing update close to the launch.\n\nAMD Ryzen 9000 \"Zen 5\" Desktop CPUs Prices For China (Rumor):\n\nCPU Name Predecessor's MSRP (Launch) 80IT's Estimated Ryzen 9000 Pricing 80IT's Initial Ryzen 9000 Pricing Ryzen 9 9950X 5499 RMB ($760) 5099 RMB ($705) 3631 RMB ($499) Ryzen 9 9900X 4299 RMB ($594) 3799 RMB ($525) 2904 RMB ($399) Ryzen 7 9700X 2999 RMB ($414) 3099 RMB ($428) 2176 RMB ($299) Ryzen 5 9600X 2249 RMB ($311) 2399 RMB ($331) 1666 RMB ($229)",
    "tags": [
      "Rumor",
      "Hardware"
    ],
    "nltk_summary": "A Chinese shopkeeper based in Bejing has a really weird yet funny way of showing off AMD Ryzen 9000 \"Zen 5\" Desktop CPU prices which appear to be lower than the Ryzen 7000 MSRP's for China.\nAMD Ryzen 9000 \"Zen 5\" Desktop CPUs Prices For China Appear To Be Much Lower Than Ryzen 7000 MSRPs80IT, a computer hardware store based in Bejing China, and affiliated with Taobao, has put up what seems to be their expected prices for China.\nPrevious \"estimated\" listing had the prices at 5099 RMB, 3799 RMB, 3099 RMB, and 2399 RMB for respective Ryzen 9000 \"Zen 5\" CPUs.\nIn addition to the prices, the shopkeeper also shares some of his personal performance metrics & compares the Ryzen 9 9950X, Ryzen 7 9700X & Ryzen 5 9600X against Intel's 14th Gen offerings.\nThe AMD Ryzen 9000 \"Zen 5\" Desktop CPUs will now be launching in August.",
    "nltk_keywords": [
      "zen",
      "chinese",
      "9700x",
      "9950x",
      "rmb",
      "series",
      "cpu",
      "desktop",
      "9000",
      "shopkeeper",
      "prices",
      "lower",
      "ryzen",
      "shows"
    ]
  }
]